[{"Keyword":"Software Developer","Location":"Portland, Oregon, United States","Job_title":"Software Engineer","Job_link":"https://www.linkedin.com/jobs/view/software-engineer-at-nike-3560334609?refId=DotEVVRXEqK0D%2FNbiajqxQ%3D%3D&trackingId=dNLUyQSgTQrFRG0AHrDTCA%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card","Company":"Nike","Company_link":"https://www.linkedin.com/company/nike?trk=public_jobs_topcard-org-name","Job_location":"              Beaverton, OR\n            ","Post_time":"\n        \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n      3 weeks ago\n  \n      ","Applicants_count":"\n          \n          \n            Over 200 applicants\n          \n        ","Job_description":"\n        Become a Part of the NIKE, Inc. TeamNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.NIKE is a technology company. From our flagship website and five-star mobile apps to developing products, managing big data and providing leading edge engineering and systems support, our teams at NIKE Global Technology exist to revolutionize the future at the confluence of tech and sport. We invest and develop advances in technology and employ the most creative people in the world, and then give them the support to constantly innovate, iterate and serve consumers more directly and personally. Our teams are innovative, diverse, multidisciplinary and collaborative, taking technology into the future and bringing the world with it.Nike, Inc., Beaverton, OR. Develop, code, configure, and test programs, systems and solutions independently with minimal supervision in order to meet defined digital product specifications. Advise product owners on discrete technology-related business problems. Formulate options, including assessing their relative merits and risks. Create robust and rapid deployment processes that have a direct impact on the business. Work with product owners to determine the best solution. Help design and build scalable software solutions to implement and integrate new technologies. Build and implement scalable applications that leverage platforms capabilities from AWS and business partners. Contribute to core marketing assets platforms and tools to enable both asset production, storage, cataloging and delivery.Applicant must have a Master’s degree in Computer Science, Engineering, or Applied Computer Science and 2 years of experience in the job offered or a computer-related occupation. Experience must include: React;  Typescript;  Ecmascript;  Angular;  Javascript;  HTML;  CSS;  SCSS;  Eslint;  UI development NIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.NIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.]]>\n      ","Seniority_level":"\n            Entry level\n          ","Employment_type":"\n          Full-time\n        ","Job_function":"\n            Information Technology and Engineering\n          ","Industries":"\n          Retail\n          ","Person_hiring":""},{"Keyword":"Software Developer","Location":"Portland, Oregon, United States","Job_title":"Software Engineer","Job_link":"https://www.linkedin.com/jobs/view/software-engineer-at-nike-3593927246?refId=DotEVVRXEqK0D%2FNbiajqxQ%3D%3D&trackingId=wGCp9J2JizT%2B%2FmIQ5rFE6w%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card","Company":"Nike","Company_link":"https://www.linkedin.com/company/nike?trk=public_jobs_topcard-org-name","Job_location":"\n              Beaverton, OR\n            ","Post_time":"\n        \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n      3 weeks ago\n  \n      ","Applicants_count":"\n          \n          \n            Over 200 applicants\n          \n        ","Job_description":"\n        Become a Part of the NIKE, Inc. TeamNIKE, Inc. does more than outfit the world’s best athletes. It is a place to explore potential, obliterate boundaries and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At NIKE, Inc. it’s about each person bringing skills and passion to a challenging and constantly evolving game.NIKE is a technology company. From our flagship website and five-star mobile apps to developing products, managing big data and providing leading edge engineering and systems support, our teams at NIKE Global Technology exist to revolutionize the future at the confluence of tech and sport. We invest and develop advances in technology and employ the most creative people in the world, and then give them the support to constantly innovate, iterate and serve consumers more directly and personally. Our teams are innovative, diverse, multidisciplinary and collaborative, taking technology into the future and bringing the world with it.Nike, Inc., Beaverton, OR. Develop, code, configure, and test programs, systems and solutions independently with minimal supervision in order to meet defined digital product specifications. Advise product owners on discrete technology-related business problems. Formulate options, including assessing their relative merits and risks. Create robust and rapid deployment processes that have a direct impact on the business. Work with product owners to determine the best solution. Help design and build scalable software solutions to implement and integrate new technologies. Build and implement scalable applications that leverage platforms capabilities from AWS and business partners. Contribute to core marketing assets platforms and tools to enable both asset production, storage, cataloging and delivery.Applicant must have a Master’s degree in Computer Science, Engineering, or Applied Computer Science and 2 years of experience in the job offered or a computer-related occupation. Experience must include: React;  Typescript;  Ecmascript;  Angular;  Javascript;  HTML;  CSS;  SCSS;  Eslint;  UI development NIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.NIKE, Inc. is committed to employing a diverse workforce. Qualified applicants will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, veteran status, or disability.]]>\n      ","Seniority_level":"\n            Entry level\n          ","Employment_type":"\n          Full-time\n        ","Job_function":"\n            Information Technology and Engineering\n          ","Industries":"\n          Retail\n          ","Person_hiring":""},{"Keyword":"Software Developer","Location":"Portland, Oregon, United States","Job_title":"Software Engineer","Job_link":"https://www.linkedin.com/jobs/view/software-engineer-at-nike-3584672343?refId=DotEVVRXEqK0D%2FNbiajqxQ%3D%3D&trackingId=frWP4JsrRDJFGgDN9Q7ykg%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card","Company":"Nike","Company_link":"https://www.linkedin.com/company/nike?trk=public_jobs_topcard-org-name","Job_location":"\n              Hillsboro, OR\n            ","Post_time":"\n        \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n      4 days ago\n  \n      ","Applicants_count":"\n          86 applicants\n        ","Job_description":"Work options: Remote\n\n\n\n\nTitle: Front-End Software Engineer\n\n\n\n\nLocation: Remote, US\n\n\n\n\nDuration: 3 Months\n\n\n\n\nThis person will join the North America Data & Analytics Organization. You will work with world-class talent in the field of Data & Software Engineering to better business insights and drive data-driven decisions across the organization. You’ll be working closely with hardworking teams - Internal partners, Product Owners, Engineering Leaders, Data Analysts, Big Data Leads, and Engineers.\n\n\n\n\nRequirements\n\n\n\n\nBachelor/Master degree in Computer Science or related technical subject area or equivalent combination of education and experience\n7+ years of relevant work experience in the Software and/or Data Engineering field\n4+ years of experience building scalable, real-time, and high-performance full stack solutions\nPrior experience in crafting and implementing highly scalable web applications using React and building user friendly UI designs, wireframes and visual layouts.\nExperience in building microservices architecture using Fargate and EBS, domain-driven design, and RESTful API design and development.\nFront-end Qualifications: experience with ReactJS, FE Design patterns, ES6 Desirable: Typescript, Jest & Unit tests, Redux, React Native, D3.js, Charts.js\nBack-end Qualifications but not limited to: Python, NodeJS.\nContainerization and Orchestration experience using tools such as Docker, EKS.\nExperience working with Big Data streaming services such as Kinesis, Kafka, etc. And NoSQL data stores such as DynamoDB, etc.\nExperience working in AWS environment primarily EMR, S3, Kinesis, Redshift, Athena etc\nExperience with source control tools such as GitHub and related CI/CD processes\nStrong understanding of algorithms, data structures, data architecture, and technical designs.\nProven ability to influence and communicate effectively with team members and business partners.\nProven track record to partner with teams in solving complex problems by taking a broad perspective to identify innovative solutions.","Seniority_level":"\n            Entry level\n          ","Employment_type":"\n          Contract\n        ","Job_function":"\n            Engineering and Information Technology\n          ","Industries":"\n          Retail\n          ","Person_hiring":""},{"Keyword":"Software Developer","Location":"Portland, Oregon, United States","Job_title":"Recent Graduate Software Engineer","Job_link":"https://www.linkedin.com/jobs/view/recent-graduate-software-engineer-at-hp-3581100648?refId=DotEVVRXEqK0D%2FNbiajqxQ%3D%3D&trackingId=MeqOcAbd4ZEbluy2SEbjGg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card","Company":"HP","Company_link":"https://www.linkedin.com/company/hp?trk=public_jobs_topcard-org-name","Job_location":"\n              Vancouver, WA\n            ","Post_time":"\n        \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n\n      4 days ago\n  \n      ","Applicants_count":"\n          \n          \n            Over 200 applicants\n          \n        ","Job_description":"Designs, analyzes, programs, debugs, troubleshoots, and modifies software applications for enhancements and new products. Formulates and defines system scope and objectives for assigned projects combining knowledge and disciplines of all aspects of a computing system (e.g., program stack, memory management, cpu, i/o, and networking utilization, coding, testing, debugging, and documentation) and develops and/or maintains advanced knowledge of computing system integration and makes recommendations or decisions on software and hardware configurations and developments.\n\nResponsibilities\n\nLearns the ropes in Installing, configuring, testing and maintaining operating systems, application software, and system management tools\nSupports internal and external software products\nCodes and programs enhancements, updates, and changes for portions and subsystems of systems software, including operating systems, compliers, networking, utilities, databases, and Internet-related tools\nExecutes established test plans and protocols for assigned portions of code; identifies, logs, and debugs assigned issues\nDevelops understanding of and relationship with internal and outsourced development partners on software systems design and development\nParticipates as a member of project team of other software systems engineers and internal and outsourced development partners to develop reliable, cost effective and high quality solutions for low to moderately- complex products\n\nKnowledge & Skills\n\nMinimal technical knowledge of software systems, demonstrated desire to learn\nStrong coursework in software development, systems engineering, software product management\nAbility to understand and deal well with rapid development cycles and remain flexible in the face of uncertainty\nExperience or understanding of software systems design tools and languages\nGood analytical and problem solving skills\nUnderstanding of design for software systems running on multiple platform types\nUnderstanding of basic testing, coding, and debugging procedures\nGood written and verbal communication skills; mastery in English and local language\n\nScope & Impact\n\nSupports software engineering leadership\nWorks closely with architects and technology leads, directly engaging with internal and external software development teams\nDirectly impacts delivery time and quality\n\nComplexity\n\nLow: Limited cross-functional/cross-organizational interaction\nApplies basic foundation of a function's principles, theories and concepts to assignments of limited scope. Uses professional concepts and theoretical knowledge acquired through specialized training, education or previous experience.\nPractical knowledge of applications within business environment. Acts as team member by providing information, analysis and recommendations in support of team efforts. Exercises independent judgment within defined parameters.\n\nEducation & Experience\n\nBachelor's degree in relevant area or demonstrated competence. Typically 2-4 years of related experience.\n\nAbout HP\n\nYou’re out to reimagine and reinvent what’s possible—in your career as well as the world around you.\n\nSo are we. We love taking on tough challenges, disrupting the status quo, and creating what’s next. We’re in search of talented people who are inspired by big challenges, driven to learn and grow, and dedicated to making a meaningful difference.\n\nHP is a technology company that operates in more than 170 countries around the world united in creating technology that makes life better for everyone, everywhere.\n\nOur history: HP’s commitment to diversity, equity and inclusion – it's just who we are.\n\nFrom the boardroom to factory floor, we create a culture where everyone is respected and where people can be themselves, while being a part of something bigger than themselves. We celebrate the notion that you can belong at HP and bring your authentic self to work each and every day. When you do that, you’re more innovative and that helps grow our bottom line. Come to HP and thrive!","Seniority_level":"\n            Entry level\n          ","Employment_type":"\n          Full-time\n        ","Job_function":"\n            Engineering and Information Technology\n          ","Industries":"\n          IT Services and IT Consulting, Computer Hardware Manufacturing, and Software Development\n          ","Person_hiring":""}]