[{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/2016040/dci-solutions-squarelogo-1535626536894.png",
    "name": "DCI Solutions",
    "ceoName": null,
    "headquarters": "Aberdeen, MD",
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "Unknown / Non-Applicable",
    "size": "1 to 50 Employees",
    "type": "Contract",
    "website": "www.dci-solutions.com",
    "yearFounded": null
  },
  "jobLocation": "Aberdeen, MD",
  "jobTitle": "Jr. Reverse Software Engineer",
  "jobDetails": "DCI Job Requirement for: Junior Reverse Software EngineerLocation: Openings in APG, MDJob Description:Provide on-site support in Research and Development of software:Designed to find vulnerabilities of:TechnologyAlgorithm DevelopmentScript, Writing, and Software Utility DevelopmentAnalysis and Reverse Engineering of:Source codeSoftware Integration and TestingTechnical Writing and DocumentationLifecycle maintenance of customer software programsCoordinate with and provide findings to AI/ML SMEs to:Improve time to discoveryIncrease automation of vulnerability discovery, characterization, and useDevelop capabilities for assisting our government partners to include:Technology ResearchVulnerability AssessmentSoftware DevelopmentCapability IntegrationSystem test and Product MaintenanceQualifications:BS in technical discipline preferred, but not requiredNOTE: Technical competency is the primary qualification in this roleRequires 3+ years of hands-on vulnerability analysis experience (Proficient)2+ years’ experience for following areas:Exploit developmentLinux/Android kernel developmentLow-level operating systems for Android (Linux acceptable)Applied ARM/AARCH64 Assembly developmentJavaScript development and C programmingHands-on Reverse Engineering experience using tools such as IDA Pro, Binary Ninja and GhidraFuzzing experience (Mayhem, AFL, KLEE)NOTE: will consider right candidate without clearanceJob Type: Full-timeSalary: $110,000 to $140,000Job Type: Full-timePay: $110,000.00 - $140,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible scheduleHealth insuranceHealth savings accountLife insurancePaid time offParental leaveProfessional development assistanceReferral programRelocation assistanceRetirement planTuition reimbursementVision insuranceSchedule:Monday to FridaySupplemental pay types:Bonus paySigning bonusExperience:Vulnerability analysis: 3 years (Preferred)software engineering: 3 years (Preferred)reverse engineering: 2 years (Preferred)exploit development: 2 years (Preferred)JavaScript and C: 2 years (Preferred)Security clearance:Top Secret (Preferred)Work Location: In personShow more  Report",
  "salary": {
    "min": 110000,
    "max": 140000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/732609/hydro-gear-squarelogo-1428498844872.png",
    "name": "Hydro-Gear",
    "ceoName": {
      "name": "Raymond Hauser",
      "photoUrl": "https://media.glassdoor.com/people/sql/732609/hydro-gear-ceo1494586660121.png",
      "__typename": "Ceo"
    },
    "headquarters": "Sullivan, IL",
    "industry": {
      "industryId": 200073,
      "industryName": "Machinery Manufacturing",
      "sectorName": "Manufacturing",
      "sectorId": 10015,
      "__typename": "EmployerIndustry"
    },
    "sector": "Manufacturing",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "Unknown / Non-Applicable",
    "size": "1001 to 5000 Employees",
    "type": "Company - Private",
    "website": "https://www.hydro-gear.com/",
    "yearFounded": 1991
  },
  "jobLocation": "Indianapolis, IN",
  "jobTitle": "Senior Software Engineer",
  "jobDetails": "The Senior Software Engineer will be responsible for directing and selecting best practices for Hydro-Gear’s Software Development Team. This technical role will have the opportunity to be at the forefront of converting drive products from traditional hydraulic to highly efficient, environmentally friendly electrical traction.\nThe Senior Software Engineer will be integral in determining the long-term direction for our software products and assist our customers and end users transition into the electrification arena. This position is ideal for an individual that enjoys mentoring less experienced technical employees to become key players on the software team.\nThe Senior Software Engineer will have the freedom to implement a software development process for new products, update existing software and provide support for customers using the software/products. The Senior Software Engineer will support the Software Team Leader and requires collaboration with other business functions including Marketing, Sales, Accounting and Operations.\nSkills Preferred\nStrong knowledge and extensive experience in C/C++. Knowledge of C#/.NET, HTTP, CSS, Javascript, Node JS, etc., is a plus.\nExperience writing product requirements and assisting with the development of firmware for embedded projects and required bootloaders\nExperience in software development methods such as Agile, RAD, and Scrum\nStrong knowledge of software testing including unit testing, integration testing, regression, etc.\nExperience with writing self-documenting code (for example, Doxygen), and an understanding of software/firmware maintenance and versioning\nKnowledge of the development of various communication means including CAN, SPI, serial, I2C, Bluetooth, Wi-Fi, etc.\nExperience with embedded design, including HW and firmware specification utilizing 16/32-bit microcontrollers such as those from ST Micro, Microchip, etc.\nKnowledge of real-time operating systems, multi-threading, inter-process synchronization using mutexes, semaphores, handling time-critical processes, etc.\nAbility to develop and mentor inexperienced technical individuals\nB.S. in Computer Science, Computer Engineering or a related technical field.\n5+ years' software development experienceShow more  Report",
  "salary": {
    "min": 84272,
    "max": 113645,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "ESTIMATED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/432275/silvus-technologies-squarelogo-1443014285133.png",
    "name": "Silvus Technologies",
    "ceoName": {
      "name": "",
      "photoUrl": null,
      "__typename": "Ceo"
    },
    "headquarters": "Los Angeles, CA",
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$1 to $5 million (USD)",
    "size": "1 to 50 Employees",
    "type": "Company - Private",
    "website": "www.silvustechnologies.com",
    "yearFounded": null
  },
  "jobLocation": "Los Angeles, CA",
  "jobTitle": "Senior Embedded Software Engineer",
  "jobDetails": "The CompanySilvus is a rapidly-growing high-tech entrepreneurial company in the heart of West Los Angeles. The company delivers the most technologically advanced Mobile Ad-Hoc Networking (MANET) solution to multiple markets including: Law Enforcement; Unmanned Systems; and Military, among others. Along with its successful MANET product line, the company also delivers on ground breaking research in the area of wireless data communications. The company has experienced rapid growth over the past 12 months and is expecting the rate of growth to continue with the introduction of new products and services.Silvus is seeking a full time senior embedded software engineer to participate in the development of Silvus’ MANET radios and advanced research projects.ResponsibilitiesImplementation of software portion of MAC (Medium Access Control) and mobile ad-hoc networking routing protocols.Implementation of network management software and web interface.Implementation of different security protocols and encryption algorithms.Implementation of audio streaming and push to talk voice applications.Analyze and improve product security and robustness to meet certain regulatory requirement such as NIST FIPS 140-2 and NIAP Common Criteria.Application and user interface development for customer demonstrations and evaluations.Implementation of testing software and product performance and reliability testing.Linux system customization and scripting.QualificationsBS Required, MS in Electrical Engineering or Computer Science a definite plus.Expert in C programming. Other language such as C++, JavaScript, Python is a plus.Linux kernel driver development experiences required.Knowledge and experience of different security protocols and encryption algorithms a huge plus.4+ years of relevant embedded system software development experiences required.Experiences with socket programming and various Internet/Ethernet protocols a plus.Experiences of software development under real-time operating system a plus.GUI and web interface development experiences a plus.Knowledge of MAC and Networking layer of a communication system a plus.Knowledge of digital signal processing a plus.Must be a U.S. person (U.S. Permanent Resident or U.S. Citizen) due to clients under U.S. government contracts.All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.Job Type: Full-timePay: $97,155.64 - $186,484.57 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insuranceLife insurancePaid time offReferral programVision insuranceSchedule:8 hour shiftMonday to FridayAbility to commute/relocate:Los Angeles, CA 90024: Reliably commute or planning to relocate before starting work (Required)Work Location: Hybrid remote in Los Angeles, CA 90024Show more  Report",
  "salary": {
    "min": 97156,
    "max": 186485,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/5781/asml-squareLogo-1633542902961.png",
    "name": "ASML",
    "ceoName": {
      "name": "Peter Wennink",
      "photoUrl": "https://media.glassdoor.com/people/sql/5781/asml-peter-wennink.png",
      "__typename": "Ceo"
    },
    "headquarters": "Veldhoven, Netherlands",
    "industry": {
      "industryId": 200070,
      "industryName": "Electronics Manufacturing",
      "sectorName": "Manufacturing",
      "sectorId": 10015,
      "__typename": "EmployerIndustry"
    },
    "sector": "Manufacturing",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$10+ billion (USD)",
    "size": "10000+ Employees",
    "type": "Company - Public",
    "website": "www.asml.com/en/careers",
    "yearFounded": 1984
  },
  "jobLocation": "Wilton, CT",
  "jobTitle": "Senior Quality Engineer",
  "jobDetails": "Location\n\nWilton - CT, US\n\nNEW Job ID: J-00272985-305\nIntroduction to the job\nJoin ASML Wilton today to receive your sign on bonus and relocation.\nOffer valid for Wilton, CT new hire offers made between now and June 30, 2023.\nASML US brings together the most creative minds in science and technology to develop lithography machines that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world’s leading chipmakers - to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, the Netherlands, and we have 18 office locations around the United States including main offices in Chandler, Arizona, San Jose and San Diego, California, Wilton, Connecticut, and Hillsboro, Oregon.\nThis position requires access to controlled technology, as defined in the Export Administration Regulations (15 C.F.R. § 730, et seq.). Qualified candidates must be legally authorized to access such controlled technology prior to beginning work. Business demands may require ASML to proceed with candidates who are immediately eligible to access controlled technology.\nRole and responsibilities\nAs a quality engineer you take responsibility for providing insight into the quality of the department’s development processes and deliverables. This includes driving quality improvements in reporting, way of working, tools, root cause analysis, and training. You also have the opportunity to help shape a new quality role within a design and development organization.\nEducation and experience\nBachelor's, Master's, PhD in Applied Physics, Electrical, Mechanical, Optical, industrial, manufacturing or Mechatronic Engineering or equivalent experience.\nBachelor's with minimum 5 years' experience.\nMaster's with minimum 2 years’ experience.\nPhD with minimum 1 year experience.\nRequired technical skills Data Visualization/Data Science (Machine Learning)/Enterprise Resource Planning (ERP) skills (e.g. Python, Tableau, Spotfire, MATLAB, JavaScript, MS Access, My SQL, Minitab, JMP, Statistics, VBScript, C, R Studio, SAP, BAAN, Oracle, Advanced Excel, C++).\nKnowledge/hands-on experience with software/technical tools like Microsoft office suites. Especially, deep data analysis using excel and its macros.\nSkills\nWorking at the cutting edge of tech, you’ll always have new challenges and new problems to solve – and working together is the only way to do that. You won’t work in a silo. Instead, you’ll be part of a creative, dynamic work environment where you’ll collaborate with supportive colleagues. There is always space for creative and unique points of view. You’ll have the flexibility and trust to choose how best to tackle tasks and solve problems.\nTo thrive in this job, you’ll need the following skills:\nCan observe and respond to people and situations and interact with others encountered in the course of work.\nCan learn and apply new information or skills.\nMust be able to read and interpret data, information, and documents.\nStrong customer focus and commitment to customer satisfaction through prioritization, quality, efficiency and professionalism.\nAbility to complete assignments with attention to detail and high degree of accuracy.\nProven ability to perform effectively in a demanding environment with changing workloads and deadlines.\nResult driven-demonstrate ownership and accountability.\nIdentifies bottlenecks and drives improvements.\nWork independently or as part of a team and follow through on assignments with minimal supervision.\nDemonstrate open, clear, concise and professional communication.\nAbility to establish and maintain cooperative working relationships with manager, co-workers and customer.\nWork according to a strict set of procedures within the provided timelines.\nSoft skill requirements: Commanding knowledge of English (verbal and written).\nDrive for continuous improvement and making use of the lessons learned.\nConvince others of your ideas.\nChange management skills.\nStrong analytical ability with a pragmatic attitude.\nAbility to work proactively and independently.\nAbility to multi-task and efficient in time management.\nExcellent verbal communication and interpersonal skills, with the ability to work in a team environment.\nWorks in medium sized teams. Assists junior engineers (1-2 FTE). Independently working as a Quality specialist. Able to motivate, steer small teams (3-5 people, e.g. RCA).\nHighly motivated, enthusiast, flexible and a good communicator.\nResult driven, good organizational, planning and prioritizing skills.\nThink broad, learn fast, take responsibility, act decisive and show critical sense.\nAbility to work in multidisciplinary team(s).\nDrive for continuous improvement; making use of the lessons learned.\nBring the Voice of the Internal/External Customer (VoC) into the department by providing feedback from customers, customer service, factory, supply chain, and integration to the department. Improve the Feedback Loop/Operational Excellence. Provide on a regular basis insight on performance in terms of parts usage, product performance, quality sensitive elements in design process adherence.\nDiversity & Inclusion\nASML is an Equal Opportunity Employer that values and respects the importance of a diverse and inclusive workforce. It is the policy of the company to recruit, hire, train and promote persons in all job titles without regard to race, color, religion, sex, age, national origin, veteran status, disability, sexual orientation, or gender identity. We recognize that diversity and inclusion is a driving force in the success of our company.\nOther information\nThis position is located on-site in Wilton, CT. It requires onsite presence to attend in-person work-related events, trainings and meetings and to further ensure teamwork, collaboration and innovation.\nA flexible workplace arrangement may be available to employees working in roles conducive to remote work (up to two days a week).\nWork in a fast-paced office environment, including working in a standing or seated position for long periods sometimes exceeding 8 hours per day, 5 days per week.\nCommute to ASML’s facility and report to work on a regular and timely basis and complete the scheduled workday on a consistent basis.\nRoutinely required to sit; walk; talk; hear; use hands to finger, handle, and feel; stoop, kneel, crouch, twist, reach, and stretch. Occasionally required to move around the campus.\nPerform office tasks using simple hand grasping, fine hand manipulation and reach associated with assigned tasks such as paperwork, computer keyboarding (e.g., Word, Excel, PowerPoint), filing, calculating, and use of telephone or other handheld electronic devices, continuously sometimes exceeding 8 hours per day, five days per week.\nHave a sufficient ability to communicate, through sight, hearing, and/or otherwise, to perform assigned tasks and maintain proper job safety conditions.\nRole within Office\nResponsibilities:\nRoutinely required to sit; walk; talk; hear; use hands to keyboard, finger, handle, and feel; stoop, kneel, crouch, twist, reach, and stretch.\nOccasionally required to move around the campus.\nOccasionally lift and/or move up to 20 pounds.\nMay require travel dependent on business needs.\nSpecific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and ability to adjust focus.\nRole within the Factory\nResponsibilities:\nMust be willing to work in a clean room environment, wearing coveralls, hoods, booties, safety glasses and gloves for entire duration of shift. Working under ISO 9000/14000 standards.\nWhile performing the duties of this job, the employee routinely is required to sit; walk; talk; hear; use hands to keyboard, finger, handle, and feel; stoop, kneel, crouch, twist, reach, and stretch.\nThe employee may occasionally lift and/or move up to 50 pounds.\nSpecific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and ability to adjust focus.\nCan work under deadlines.\nThe environment generally is moderate in temperature with moderate to high noise level.\nMust be willing to work a compressed work week schedule – twelve-hour long shift and rotating from three to four days a week.\nThis must include references to day and night shifts for accommodation purposes.\nEOE AA M/F/Veteran/DisabilityShow more  Report",
  "salary": {
    "min": 78823,
    "max": 109659,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "ESTIMATED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "Bravo Team",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Mooresville, NC",
  "jobTitle": "Senior Embedded Systems Engineer",
  "jobDetails": "Are you a talented hands-on Embedded Systems Engineer looking for a non-corporate work environment that focuses on doing awesome work for clients while surrounded by an awesome team? If so, keep reading…..Job description: Senior Embedded Systems EngineerAbout UsBravo Team LLC is an ISO 9001:2015 certified engineering design and fabrication company based in Mooresville, NC. We help businesses, engineers, and inventors bring their ideas to life through innovative engineering design, prototyping, machining, and fabrication capabilities. We develop a wide variety of prototype and proof of concept machines and products.Bravo Team takes pride in helping customers solve problems and achieve their goals quickly and cost-effectively, whether a customer-supplied build-to-print drawing or a custom design.At our core, we are a special force engineering team that completes challenging technical work on time and on budget. We use our collective skill and talent to create novel solutions and products. Along these lines, we:Get better by completing challenging projects that cause us to growGuarantee value to our customersInvest in our futureDon’t back downDo what it takes to guarantee our futureOur office is in the historic Merino Mill in downtown Mooresville. This 8300 sq. ft. facility houses a well-lit office area and adjoining shop. Our office includes CAD workstations, an electronics lab, a break room, and meeting rooms. Our fabrication shop is filled with natural light and well equipped with CNC mills, a CNC lathe, saws, a laser cutter, welding capabilities, and a PCB pick and place assembly line. As such, our engineers are empowered to go directly from a conceptualized design to working in collaboration with our full-time machinists to develop prototypes in house. This ability to quickly iterate design ideas and converge on a viable solution is further enhanced by our farm of FDM and SLA 3D printers.We place high value on team culture, team dynamics, and professional development. Social events, team building exercises and company-wide learning opportunities are emphasized. We offer competitive salaries, comprehensive benefits, and paid time off. We look for candidates that can bring a fresh perspective to the team, but we will only hire teammates that align with our core values:· Remarkable Integrity· Embrace Growth· Transparent Excellence· Win Together· Own the ExperienceWe are looking for an experienced hands-on Senior Computer Engineer to support development for our customers and for our own products. The ideal candidate will have a can-do attitude and a desire to learn and grow while fielding a variety of work in the following areas:· Machine Design· Automation & Controls· Build-to-Print/Fabrication· Product DevelopmentJOB RESPONSIBILITIES: SENIOR EMBEDDED SYSTEMS ENGINEERWe are looking for a full-time Senior Embedded Systems Engineer to help us manage the growing demands of the company. The ideal candidate will create, draft, and design product layouts and schemes using customer specifications and recommendations. This individual will test products and adjust where necessary. We are specifically looking for someone who pays attention to detail and who is responsive and willing to help with the following:JOB RESPONSIBILITIES: SENIOR EMBEDDED SYSTEMS ENGINEERStrong PCB design skills and at least 2 years of experience designing, building, and testing/debugging circuitsGeneral software skillsEmbedded firmware developmentApp developmentDesign and development of software solutions, software requirements analysis, software configuration managementProvide networking and system/application designPerform system software and hardware setupPerform system integration and testingCustomize hardware, system, and network configuration according to client requirementsParticipate in the whole software development procedure, from testing requirements to verification and validation of a systemSupply application/control system design and development to Programmable Logic Controllers (PLCs) and Distributed Control Systems (DCS) to port with process instrumentationEnsure availability and stability of applications and management system hardware by exact and thorough maintenance and troubleshootingDevelop or modify management system applications to meet evolving goals or business production needsDetermine the main cause of software system issues and create corrective actions that are effectiveProvide mentorship to the rest of the team and serve as a technical resource as neededAssist in the sales process and generation of Statements of Work as neededQualificationsBachelor’s Degree in Computer Science or Computer EngineeringMS Degree is a plus5 years of related experiencePCB design skills are requiredHands-on development skills in two or more application languages, such as: C, C++, Python, Java, JavaScript, C#, Objective-C, Dart, Swift or equivalent languagesExcellent organization, interpersonal, and leadership skillsStrong commitment to providing superior client satisfactionAbility to work on several projects in parallel in a fast-paced environmentSalary:Based on relevant work experienceBenefit Conditions:Only full-time employees are eligibleVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobWork RemotelyNoThis Job Is Ideal for Someone Who Is:Achievement-oriented -- enjoys taking on challenges, even if they might failAutonomous/Independent -- enjoys working with little directionJob Type: Full-timePay: $90,000.00 - $130,000.00 per yearBenefits:401(k)Dental insuranceFlexible scheduleHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceVision insuranceSchedule:Monday to FridaySupplemental pay types:Bonus payWork Location: In personShow more  Report",
  "salary": {
    "min": 90000,
    "max": 130000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "Confidential",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Springs, PA",
  "jobTitle": "Software Developer",
  "jobDetails": "Are you a natural problem solver with expertise in developing and enhancing programs? If so, we have just the opportunity for you! The successful candidate is a disciplined, self-motivated engineer who enjoys working with people as much as he or she enjoys working with the technology.Software Developer position is responsible for developing software solutions in a multi-platform client environment. This exciting and challenging position will provide you with an outlet to exercise your passion for developing, groundbreaking software solutions that meet business demand in Health Insurance Market.Core Responsibilities:Program for ten (10) or more simultaneous application development projectsComplete project investigations including reporting findings and estimated hoursComplete general and detail design specificationsComplete coding and documentation per general and detail design specificationsParticipate in and complete unit testing / resulting object corrections as requiredGenerate appropriate distribution packages and distribute / install objects for completed projects.Act as a technical escalation support resource for the companySkills:A Bachelor’s Degree required5-7 Years of VB.NET (.NET Forms with Visual Basic programming language) experience5-7 Years MS SQL Server Database experience5-7 Years of application lifecycle management, release management, and following industry coding best practicesJava, JavaScript, J2EE, C++, C, C#, .NET Framework, AngularJS, jQuery, Git, PERL, Bash, Python, Servlets, Struts, Eclipse, JSP, Velocity, ASP.NET, VB.NET, WebSphere, AJAX, LINQ, JSON, Web Services, XML, HTML, CSS, SharePoint, Linux, Oracle, SQL Server, SAP DB, Sybase, Access.Job Type: Full-timePay: $50.00 - $65.00 per hourBenefits:Dental insuranceHealth insurancePaid time offVision insuranceSchedule:8 hour shiftMonday to FridaySupplemental pay types:Bonus payEducation:Bachelor's (Preferred)Experience:Software Development: 5 years (Preferred)Work Location: In personShow more  Report",
  "salary": {
    "min": 104000,
    "max": 135200,
    "payPeriod": "HOURLY",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/336837/quality-transportation-services-squarelogo-1462538690113.png",
    "name": "Quality Transportation Services, Inc.",
    "ceoName": {
      "name": "Kevin J. Gallagher",
      "photoUrl": "https://media.glassdoor.com/people/sql/336837/quality-transportation-services-ceo1546573767989.png",
      "__typename": "Ceo"
    },
    "headquarters": "Mechanicsville, VA",
    "industry": {
      "industryId": 200128,
      "industryName": "Rail Transportation",
      "sectorName": "Transportation & Logistics",
      "sectorId": 10024,
      "__typename": "EmployerIndustry"
    },
    "sector": "Transportation & Logistics",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$5 to $25 million (USD)",
    "size": "51 to 200 Employees",
    "type": "Company - Private",
    "website": "www.qts.com",
    "yearFounded": 1988
  },
  "jobLocation": "Mechanicsville, VA",
  "jobTitle": "Application Developer",
  "jobDetails": "Quality Transportation Services, Inc., located in Mechanicsville VA, has an opening for a talented and energetic Application Developer for our fast-growing business that concentrates in the North American Rail Logistics sector.SUMMARY OF POSITION:QTS is seeking an experienced Application Developer to support the ongoing development and deployment of complex technology solutions through the entire application stack. The successful candidate will play an active role in developing applications that will enable QTS to meet strategic goals and serve the needs of its customers. The candidate will lead application development efforts, as assigned, for specific business and technology solutions ensuring they meet the quality and performance standards of current leading technology principles. Additional duties include assisting in the design and development of applications and standards, working with the design teams, Business Analysts and key stake holders to continually improve the quality of all solutions used and created in the application ecosystem.RESPONSIBILITIES:o Design, build, and maintain efficient, reusable, secure and reliable codeo Ensure the best possible performance, quality, security and responsiveness of all applications, both new and existingo Create custom applications using application development tools and SQL Server 2012 and other relation database solutions and productso Identify and resolve issues/risks related to applications and recommend solutionso Be part of a team of developers that helps design teams deliver excellent solutions in a timely mannero Provide technical support to organization stake holders.\\o Participate in project meetings with management and team members and provide project statuso Turn Business Requirement Docs (BRDs) and Use Cases into functional applicationso Follow and improve application development standards, code, code organization and automationo Support (and improve when applicable) the QTS Business Application Development Process (BADP), contribute and maintain a uniform and consistent data dictionary, and contribute cross-cutting concerns for use and re-use, wherever applicable, within the integrated technology suite of QTS.o Maintain user confidence through proper and effective confidentiality and security practiceso Work with the all other teams from 8-5, Monday thru Friday, at 8235 Meadowbridge Rd, Mechanicsville, VA. (unless working remotely).o To be a positive resource to everyone around you; to be polite, professional and proactive in what you do and what you say and do your best every day.QUALIFICATIONSo Extensive knowledge and proven skills of the following:o Web development (full stack)o Relational databases (MSSQL 2012-2016), Postgres, MySQL and others)o System Development Life Cycleo Object oriented Programming methodologieso Software Development Life Cycle (SDLC)o Application and systems securityo Project management techniqueso Agile development environment (Scrum specifically)o Responsive UI design patterns and frameworkso Development experience with ASP .NET Web APIo C# and related Web-based UI development platforms/languages to include: HTML5, CSS, SASS, Javascript, jQuery, JSON, XML, Otherso .NET MVC Framework and other frameworks such as Angularo Ability to analyze, design, implement, and maintain IT applications and databaseso .NET development using Entity Framework, XML, JSON, web services, and SOA conceptsPREFERRED EXPERIENCE & EDUCATION:Ideal candidate must be disciplined and demonstrate aptitude for learning new business processes. Candidate must be comfortable in a well-paced team environment. Candidate must be able to exercise critical thinking, communicate clearly in writing and in speech and possess positive personal relationship skills. Candidate should be familiar with Design methods, various forms of documentation (BRDs, Flow charts, User Stories, Test Plans, etc.) and have a working level of technical skill. Additional preferred qualifications are:o B.S. degree in Computer Science, Software Engineering or equivalent experienceo Experience with C # (5-10 years)o Experience with JIRA preferredo Experience with Agile Development processo Experience in the Transportation space a plusQTS offers excellent benefits and a competitive salary. Submit resume, cover letter and salary requirements to: QTS-HR @ qts.com or fax to (804) 277-8518.Job Type: Full-timePay: $30.00 - $42.00 per hourBenefits:401(k)401(k) matchingDental insuranceFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offVision insuranceCompensation package:Yearly payExperience level:7 yearsSchedule:8 hour shiftAbility to commute/relocate:Mechanicsville, VA 23116: Reliably commute or planning to relocate before starting work (Preferred)Education:Bachelor's (Preferred)Experience:C#: 5 years (Required)Jira: 1 year (Required)Agile: 1 year (Required)Work Location: Hybrid remote in Mechanicsville, VA 23116Show more  Report",
  "salary": {
    "min": 62400,
    "max": 87360,
    "payPeriod": "HOURLY",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/358425/utility-relay-squarelogo-1634635360258.png",
    "name": "Utility Relay Company LTD",
    "ceoName": null,
    "headquarters": "Auburn Township, OH",
    "industry": {
      "industryId": 200022,
      "industryName": "Advertising & Public Relations",
      "sectorName": "Media & Communication",
      "sectorId": 10016,
      "__typename": "EmployerIndustry"
    },
    "sector": "Media & Communication",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$5 to $25 million (USD)",
    "size": "1 to 50 Employees",
    "type": "Company - Private",
    "website": "www.utilityrelay.com",
    "yearFounded": null
  },
  "jobLocation": "Chagrin Falls, OH",
  "jobTitle": "Firmware/Software Engineer",
  "jobDetails": "Experienced mid-level embedded firmware/software engineer responsible for full product life cycle including design, development, debugging, testing, and maintenance.Requirements:· Bachelor’s degree in Engineering/Computer Science or equivalent, with a minimum of 5 years’ practical experience.· Knowledge of embedded development tools, C/C++ and assembly languages, emulators, debuggers, real-time operating systems.· Solid understanding of board-level hardware (analog & digital), 8-bit to 32-bit microcontroller architectures.· Knowledge of communications interfaces and protocols.· Proficient with the use of meters, oscilloscopes, and logic analyzers.· Project and team leadership skills.Additional languages, tools, or capabilities that would be a plus:· C#, .NET, Modbus protocol, TCP/IP (Ethernet), Visual Basic, JavaScript, HTML, XML, USB, Bluetooth, SQL Server.· Experience developing Windows, iOS, and Android applications.Position offers excellent working conditions and benefitsStarting range of compensation is between $80,000 - $100,000 however, Compensation will be adjusted for candidates with more qualifications.***No Relocation / Local Candidates only.*** Principals only. Recruiters, please don't contact this job poster and/or company.Benefit Conditions:Waiting period may applyThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedInnovative -- innovative and risk-takingTeam-oriented -- cooperative and collaborativeVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobWork RemotelyNoJob Type: Full-timePay: $80,000.00 - $100,000.00 per yearBenefits:Dental insuranceHealth insuranceLife insurancePaid time offRetirement planVision insuranceSchedule:8 hour shiftApplication Question(s):Are you a resident of Ohio?Experience:practical: 8 years (Required)Work Location: In personShow more  Report",
  "salary": {
    "min": 80000,
    "max": 100000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/236621/futurex-squareLogo-1645373863370.png",
    "name": "Futurex",
    "ceoName": {
      "name": "Brett Smith",
      "photoUrl": null,
      "__typename": "Ceo"
    },
    "headquarters": "Bulverde, TX",
    "industry": {
      "industryId": 200060,
      "industryName": "Computer Hardware Development",
      "sectorName": "Information Technology",
      "sectorId": 10013,
      "__typename": "EmployerIndustry"
    },
    "sector": "Information Technology",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "Unknown / Non-Applicable",
    "size": "51 to 200 Employees",
    "type": "Company - Private",
    "website": "www.futurex.com",
    "yearFounded": 1981
  },
  "jobLocation": "Bulverde, TX",
  "jobTitle": "Web Application Developer",
  "jobDetails": "Futurex is seeking a Front-end Software Engineer for full-time employment at Futurex’s Engineering Campus in Bulverde, 15 miles north of San Antonio, Texas. The ideal Web Application Engineer has strong knowledge of JavaScript frameworks, working knowledge of RESTful API design concepts, familiarity with Python and Python frameworks, demonstrated experience working within a professional development environment, and is adept at developing reusable front-end components. The ideal candidate is ready to take on new challenges in a fast-paced learning environment.\nPrimary Responsibilities\nDesign, develop, and maintain customer-facing web services\nImplement intuitive front-end user experiences, and scalable back-end services\nAnalyze service stack and make recommendations for further improvements\nCommunicate effectively to help bridge stakeholder and development requirements\nAssist with deployment, support, and operations where necessary\nMaintain confidentiality with regard to information being processed, stored, or accessed\nOther duties as required\nRequirements\nQualifications\nTwo or more years of experience developing and managing a service-based architecture\nExperience with modern JavaScript frameworks and tools\nExperience with Python and Python web frameworks such as Django, Flask, Tornado\nExperience with REST API development\nExperience with Git based version control software such as GitLab/GitHub\nExperience with SQL and ORM libraries such as SQLAlchemy\nExperience with CI/CD tools such as Jenkins/GitLab CI\nExperience with Linux\nPreferred\nLeadership experience\nCapability to work independently or within a group\nExperience with Vue framework and Vue CLI\nExperience with NodeJS, Node Package Manager, and Webpack\nBackend development experience with languages such as C/C++\nExperience with concepts such as microservices, containers, and container orchestration using Docker and Kubernetes\nExperience with Agile or DevOps SDLC methodologies\nAbility to have a holistic view of service development and deployment architecture\nUnderstanding of SLA requirements and role of high availability architectures, performance optimization, and monitoring techniques\nBenefits\nFlexible scheduling policy\nCompany-provided snacks and drinks\nHealth, dental, vision, life, and short/long-term disability insurance\nPaid vacation, holidays, and sick leave\nComplimentary gym membership\nRetirement plan with employer contribution matchShow more  Report",
  "salary": {
    "min": 64633,
    "max": 97696,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "ESTIMATED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "Bravo Team",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Mooresville, NC",
  "jobTitle": "Computer Engineer",
  "jobDetails": "Are you a talented hands-on Computer Engineer looking for a non-corporate work environment that focuses on doing awesome work for clients while surrounded by an awesome team? If so, keep reading…..Job description: Senior Computer EngineerAbout UsBravo Team LLC is an ISO 9001:2015 certified engineering design and fabrication company based in Mooresville, NC. We help businesses, engineers, and inventors bring their ideas to life through innovative engineering design, prototyping, machining, and fabrication capabilities. We develop a wide variety of prototype and proof of concept machines and products.Bravo Team takes pride in helping customers solve problems and achieve their goals quickly and cost-effectively, whether a customer-supplied build-to-print drawing or a custom design.At our core, we are a special force engineering team that completes challenging technical work on time and on budget. We use our collective skill and talent to create novel solutions and products. Along these lines, we:Get better by completing challenging projects that cause us to growGuarantee value to our customersInvest in our futureDon’t back downDo what it takes to guarantee our futureOur office is in the historic Merino Mill in downtown Mooresville. This 8300 sq. ft. facility houses a well-lit office area and adjoining shop. Our office includes CAD workstations, an electronics lab, a break room, and meeting rooms. Our fabrication shop is filled with natural light and well equipped with CNC mills, a CNC lathe, saws, a laser cutter, welding capabilities, and a PCB pick and place assembly line. As such, our engineers are empowered to go directly from a conceptualized design to working in collaboration with our full-time machinists to develop prototypes in house. This ability to quickly iterate design ideas and converge on a viable solution is further enhanced by our farm of FDM and SLA 3D printers.We place high value on team culture, team dynamics, and professional development. Social events, team building exercises and company-wide learning opportunities are emphasized. We offer competitive salaries, comprehensive benefits, and paid time off. We look for candidates that can bring a fresh perspective to the team, but we will only hire teammates that align with our core values:· Remarkable Integrity· Embrace Growth· Transparent Excellence· Win Together· Own the ExperienceWe are looking for an experienced hands-on Senior Computer Engineer to support development for our customers and for our own products. The ideal candidate will have a can-do attitude and a desire to learn and grow while fielding a variety of work in the following areas:· Machine Design· Automation & Controls· Build-to-Print/Fabrication· Product DevelopmentJOB RESPONSIBILITIES: SENIOR COMPUTER ENGINEERWe are looking for a full-time Senior Computer Engineer to help us manage the growing demands of the company. The ideal candidate will create, draft, and design product layouts and schemes using customer specifications and recommendations. This individual will test products and adjust where necessary. We are specifically looking for someone who pays attention to detail and who is responsive and willing to help with the following:JOB RESPONSIBILITIES: SENIOR COMPUTER ENGINEERStrong PCB design skills and at least 2 years of experience designing, building, and testing/debugging circuitsGeneral software skillsEmbedded firmware developmentApp developmentDesign and development of software solutions, software requirements analysis, software configuration managementProvide networking and system/application designPerform system software and hardware setupPerform system integration and testingCustomize hardware, system, and network configuration according to client requirementsParticipate in the whole software development procedure, from testing requirements to verification and validation of a systemSupply application/control system design and development to Programmable Logic Controllers (PLCs) and Distributed Control Systems (DCS) to port with process instrumentationEnsure availability and stability of applications and management system hardware by exact and thorough maintenance and troubleshootingDevelop or modify management system applications to meet evolving goals or business production needsDetermine the main cause of software system issues and create corrective actions that are effectiveProvide mentorship to the rest of the team and serve as a technical resource as neededAssist in the sales process and generation of Statements of Work as neededQualificationsBachelor’s Degree in Computer Science or Computer EngineeringMS Degree is a plus5 years of related experiencePCB design skills are requiredHands-on development skills in two or more application languages, such as: C, C++, Python, Java, JavaScript, C#, Objective-C, Dart, Swift or equivalent languagesExcellent organization, interpersonal, and leadership skillsStrong commitment to providing superior client satisfactionAbility to work on several projects in parallel in a fast-paced environmentSalary:Based on relevant work experienceBenefit Conditions:Only full-time employees are eligibleVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobWork RemotelyNoThis Job Is Ideal for Someone Who Is:Achievement-oriented -- enjoys taking on challenges, even if they might failAutonomous/Independent -- enjoys working with little directionJob Type: Full-timePay: $90,000.00 - $130,000.00 per yearBenefits:401(k)Dental insuranceFlexible scheduleHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceVision insuranceSchedule:Monday to FridaySupplemental pay types:Bonus payWork Location: In personShow more  Report",
  "salary": {
    "min": 90000,
    "max": 130000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/363084/wings-financial-cu-squarelogo-1424859899428.png",
    "name": "Wings Financial Credit Union",
    "ceoName": {
      "name": "R. Frank Weidner",
      "photoUrl": null,
      "__typename": "Ceo"
    },
    "headquarters": "Saint Paul, MN",
    "industry": {
      "industryId": 200048,
      "industryName": "Banking & Lending",
      "sectorName": "Financial Services",
      "sectorId": 10010,
      "__typename": "EmployerIndustry"
    },
    "sector": "Financial Services",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$5 to $10 billion (USD)",
    "size": "501 to 1000 Employees",
    "type": "Company - Private",
    "website": "https://www.wingsfinancial.com",
    "yearFounded": 1938
  },
  "jobLocation": "Apple Valley, MN",
  "jobTitle": "Azure DevOps Engineer",
  "jobDetails": "PRIMARY PURPOSE: Develop, implement, and maintain core DevOps principals and standards while working with various IT business units to promote agile and effective deployments of products and/or services for Wings Financial Credit Union. Duties will include development of solution(s) for cloud and on-premise deployments as well as assist others on aspects automation, deployment, scripting and pipelining and configurations sets for varying code bases.\n\nESSENTIAL FUNCTIONS include the following. Other duties may be assigned.\n\nPlan, Configure, Implement, maintain DevOps Principals and guidelines for various functions of Information Technology as well as other business aspects.\nCollaborate with our development team to deploy and maintain critical applications on cloud-native microservices architecture.\nDevelop and maintain varying templates and code bases related to DevOps CI/CD pipelines and structure.\nImplement and maintain various infrastructure architectures directed by the enterprise architecture team.\nDevelop and maintain Azure DevOps Organizations for code management and deployment.\nCreate and collaborate with infrastructure as a code mentality for varying groups and deployment of products and/or services.\nManage and maintain various AKS and bare metal kuberentes clusters as well as standalone docker developmental environments.\nDevelop and configure various test, monitoring and alerting solutions specified for CI/CD deployments.\nAct as a key collaborative resource with business, leadership, and technology teams for routine issues and project-related requirements.\nDevelop and maintain knowledge base and procedural documentation utilizing the department documentation framework.\nFollow change control procedures and provide necessary notification for systems changes.\nRemain engaged with company-wide system enhancements of software, hardware, networking, cloud services and data communications.\nKeep up to date on modern technologies and trends and advocate for their inclusion within products when it makes sense\nSupport engagement in a continuous cross-training environment.\nPerform other duties as determined by the Data Center Operations Manager or IT management.\nEDUCATION and EXPERIENCE\n\nAssociate’s Degree (AA) and five (5) + years related experience in DevOps or infrastructure administration in an enterprise environment, or equivalent combination of education and experience.\nAdvanced knowledge of CI/CD platforms and solutions, such as Azure Devops, Jenkins, Gitlab, Github.\nAdvance knowledge of how to use and maintain Git and repos.\nAdvanced knowledge of containerization and orchestration platforms such as Kuberentes, Docker, Containerd, Portainer or other industry standard enterprise platforms.\nAdvance knowledge of infrastructure as code software such as Azure Resource Manager, HashiCorp Terraform, Ansible, Puppet or Chef.\nExperience implementing solutions in Microsoft Azure or other cloud service provider infrastructure, platform, and software service environments.\nExperience with software development management software suites such as Azure Boards, Atlassian Jira or other enterprise solutions.\nKnowledge and experience with various software and scripting languages, such as yaml, javascript, python, C++, C#, React, Go, PowerShell, Bash.\nKnowledge and experience with various virtual server administration and deployment platforms such as Vmware ESXI, Hyper-V, Proxmox or Nutanix AOS.\nKnowledge and experience with Linux server administration.\nAbility to work in a fast paced, Agile and collaborative environment.\nKnowledge of credit union financial services beneficial.\nOrganization and prioritization skills.\nAbility to work alone or with little supervision.\nWillingness to pursue further education in meeting infrastructure needs with IT.\n\n\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)Show more  Report",
  "salary": {
    "min": 82546,
    "max": 114812,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "ESTIMATED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "theCoderSchool Raleigh",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Cary, NC",
  "jobTitle": "Coding Instructor (Code Coach / Teacher)",
  "jobDetails": "About ustheCoderSchool, Cary and RaleighCoder School is a new kind of after-school coding program that focuses on the individuality of each student, customizing our teachings depending on their skills and the desires. From graphical languages like Snap or Scratch to more powerful stuff like Python or Javascript or HTML5 and even the advanced coding like Java and C++, we're ready to inspire you and amaze you.DescriptiontheCoderSchool Cary & Raleigh offers after school programs to kids interested in learning to code. We provide a fun, energetic, and inspirational environment to bring out that inner hacker in all kids!The Code Coach position offers anywhere from 10-20 hours/week, depending on your schedule and availability.You will be running in person computer coding classes where you will be making various projects and games with Kids. You will be trained with our projects but also have freedom to make your own.This is our 6th year in the area and we guarantee one thing - coding camps are super fun!!Who should apply? High School Students, College Students, Computer Science Students, Computer Programmers, Game Makers, Computer Science Teachers, Math Teachers.Requirements (One need not have all)Able to work with kids (MUST).Python, Javascript, SCRATCH coding languages. If you have note heard about SCRATCH earlier, it is OK.HTML/HTML5/CSSJava/C/C++Unity Game developmentRoblox programmingResponsibilitiesA Coding or STEM Code Coaching Instructor is a mentor who teaches kids (Ages 7-18) how to code. At theCoderSchool, we have range of technologies to teach - your assignment will depend on schedule, ability, and desire.- Give back to the community and help grow our next generation by sharing your knowledge of technology- Have the flexibility to teach what you're most comfortable with, and learn new things along the way.- Meet and communicate with parents - many of whom will be techies themselves, who work at some of the best companies and startups in the Triangle Area- Meet, mentor, and grow amazing kids who are ready to be our next generation of coders!What do we want from you?PASSION. All caps! This is all about giving back to the kids. We need to see goose bumps when your student ROCKS a code challenge.Great Communicator. There will be plenty of chatting with parents, and of course patience is a virtue when it comes to kids!Coding Skills. Strong grasp of general technologies and uber-logical thinker. Deep technical skills aren't required - we prefer you communicate well and find answers along with students sometimes.Apply if you are energetic and will enjoy working with children.Apply if you love to work with technology and computers.Apply if you think kids safety is the highest priority.Apply today!''Work Remotely NoJob Type: Part-timePay: $16.00 - $20.00 per hourBenefits:Employee discountFlexible scheduleSchedule:Evening shiftMonday to FridayWeekend availabilitySupplemental pay types:Commission payAbility to commute/relocate:Cary, NC 27519: Reliably commute or planning to relocate before starting work (Required)Education:Bachelor's (Preferred)Experience:Scrum: 1 year (Preferred)Work Location: In personShow more  Report",
  "salary": {
    "min": 33280,
    "max": 41600,
    "payPeriod": "HOURLY",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/424118/hurricane-electric-squarelogo.png",
    "name": "Hurricane Electric",
    "ceoName": {
      "name": "Mike Leber ",
      "photoUrl": null,
      "__typename": "Ceo"
    },
    "headquarters": "Fremont, CA",
    "industry": {
      "industryId": 200120,
      "industryName": "Cable, Internet & Telephone Providers",
      "sectorName": "Telecommunications",
      "sectorId": 10023,
      "__typename": "EmployerIndustry"
    },
    "sector": "Telecommunications",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$25 to $100 million (USD)",
    "size": "51 to 200 Employees",
    "type": "Company - Private",
    "website": "www.he.net",
    "yearFounded": 1994
  },
  "jobLocation": "Remote",
  "jobTitle": "Software Engineer (Remote) - Network Protocols BGP, Sflow, geoip, SSL/TLS",
  "jobDetails": "Leading Internet backbone Hurricane Electric seeks a Network Software Engineer to work on several Internet network related software projects involving BGP, BGP flow spec, sflow, netflow, and global Internet routing analysis. These services will be composed of backend components that are operational or analytical and simple web interfaces as the front end.To be considered for this position you must have past software engineering experience involving processing or creating any one or more of the following: 1) BGP route or flowspec announcements, 2) BGP routing table data, 3) sflow/netflow data, 4) a system that produced geoip data (not just a client that used geoip data).Ideally you know a suitable low level backend language such as C, Go, or Rust that can be used to write or otherwise modify existing BGP daemon (for making or ingesting BGP announcements/withdrawals) or sflow/netflow processing daemons, and a few scripting languages (for easier programming tasks, such as making quick web based tools for our staff, customers, or the public). Also you are expected to have a working knowledge of SQL as well as any other database languages you prefer to use depending on the situation.Hurricane Electric's Internet backbone network connects to over 9200 networks in 45 countries.Our customers are Internet companies and large Internet networks.We develop and maintain tools for network engineers to use such as: http://bgp.he.net http://lg.he.net http://he.net/layer2 http://he.net/3d-mapResponsibilities:Write a simple web interface front end and a network protocol related (i.e. BGP, sflow, etc) back end for several different Network Software projects.Requirements:2+ years software engineering involving BGP, BGP flowspec, and/or sflow/netflow4+ years software engineeringSolid knowledge of UNIX and TCP/IP network fundamentalsPractical knowledge of protocols such as: IPv6, ARP, DNS, DHCP, HTTP, SSH, SNMPKnowledge of C, Go, or Rust required (to be able to write low level code to speak or ingest BGP or sflow messages).Knowledge of PHP, Python, Ruby, Perl, or Javascript a plus.Because this is a programming job, there will be one or more reasonable coding assessments. We apologize in advance for needing you to do this, we get many applicants with a very wide range of experience and competency. You can't tell just by looking at somebody's degree or by their communication skills during an interview whether they can program.Must have prior work experience using SQL and Linux.2+ years of experience working directly or indirectly with networks in a 24x7 production environment a plus.Experience working directly or indirectly with Cisco, Juniper, Extreme/Brocade, or Arista routers and switches a plus.Hands-on experience with network diagnostic tools such as ping, traceroute, mtr, iperf, dig, and whoisPossess excellent verbal/written (English) communication skillsMust have a clean background and be drug-freeJob Type: Full-timePay: $140,000.00 - $150,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee discountHealth insurancePaid time offTuition reimbursementSchedule:Monday to FridaySupplemental pay types:Bonus payExperience:relevant: 3 years (Required)Language:English (Required)Work Location: RemoteShow more  Report",
  "salary": {
    "min": 140000,
    "max": 150000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/2450445/jobot-squareLogo-1682674051407.png",
    "name": "Jobot",
    "ceoName": {
      "name": "Heidi Golledge",
      "photoUrl": "https://media.glassdoor.com/people/sql/2450445/jobot-ceo1624496693098.png",
      "__typename": "Ceo"
    },
    "headquarters": "Newport Beach, CA",
    "industry": {
      "industryId": 200032,
      "industryName": "HR Consulting",
      "sectorName": "Human Resources & Staffing",
      "sectorId": 10026,
      "__typename": "EmployerIndustry"
    },
    "sector": "Human Resources & Staffing",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$100 to $500 million (USD)",
    "size": "501 to 1000 Employees",
    "type": "Company - Private",
    "website": "https://jobot.com/",
    "yearFounded": 2018
  },
  "jobLocation": "Bakersfield, CA",
  "jobTitle": "Site Reliability Engineer",
  "jobDetails": "This Jobot Job is hosted by: Tammy Power\nAre you a fit? Easy Apply now by clicking the \"Apply On Company Site\" button and sending us your resume.\nSalary: $110,000 - $120,000 per year\n\nA bit about us:\n-\n\nWe are a stable and diverse management company that has been in business 50 years in Bakersfield, Ca. We operate primarily in retail and wholesale of fuels, fuel transportation and other related petroleum products providing finance, accounting, human resources, and technical infrastructure and support to all of our affiliate operating companies. Come join our team!\n\nWhy join us?\n-\n\nWe believe our employees are our most important asset\nBase plus bonus\nConvenient Bakersfield location\nWorks directly with the CFO\nOver 50 years in business\nWell-tenured staff\nExcellent core values\nDedicated Leadership\nFull benefits\nExcellent culture\nWork/life balance\n\nJob Details\n-\n\nResponsibilities and Duties\n\nDevelop and maintain the company’s data center, infrastructure, and assets used across the enterprise including but not limited to servers, networks, firewalls, switches and point-of-sale system\nProvide engineer-level support for the company’s data centers, networks, telecommunications, systems and commercially-of-the-shelf and custom develop applications\nMaintain services and ensure availability, reliability, security, latency and overall health of the company’s information systems\nProvide capacity planning, change management and emergency response to enterprise-wide issues\nResponsible for the administration, support, development, integration, asset management, and documentation of servers, network and telecom assets or initiatives. The Network/Telecom participates in all phases of the IT Service Lifecycle as necessary, conduct root cause analysis, apply corrective action plans, and creating post mortem reports\nResponsible for administration, support, development, integration, and documentation of commercially off-the-shelf and custom applications used across the enterprise\nServe as a subject matter expert in all phases of the software-development-lifecycle including but not limited to conducting root cause analysis, applying corrective action plans, and completing post-mortem reports\nEngage in the entire lifecycle (from inception, design, planning, deployment, operation and maintenance) continuous improvement) of IT service management of existing and next generation IT platform\nLiaison for the IT department and work with functional managers to drive projects from inception to completion\nProvide 24x7 availability two weeks per-month\n\n\nQualifications\n\n5 or more years of experience in an IT engineering level role and as part of a matrixed team supporting a diverse range of technologies infrastructure from data center to retail point of sale equipment\nAt least a bachelor's degree, in Computer Science, MIS or another technical field Working knowledge of the following\nStrong knowledge of virtualization, storage, servers, and data protection (Veeam) and an In- depth knowledge of virtualization (VMWare) and three-tier data-center architecture, hyper- converged architecture\nWorking knowledge of Edge computing a huge-plus\nWorking knowledge of web development technologies (HMTL/CSS/JavaScript/JSON/AJAX), APIs, SQL (views, stored procedures, CRUD, ETL)\n\nExperience in code-refactoring/migration a plus\nA strong command and confident use of the English language (85% or above) in both oral and in writing\nAbility to handle multiple tasks and meet deadlines\nAbility to work efficiently and productively\nCapable of exercising extreme discretion and independent judgment\nAbility to handle confidential information professionally\nProven track record for providing stellar customer service to a wide-range of end-users (from C- Suite to construction-workers)\nTakes constructive feedback and a lifelong learner\nPossess deep and infectious passion for technology and its ability to empower an organization\nInterested in hearing more? Easy Apply now by clicking the \"Apply On Company Site\" button. #indtier2Show more  Report",
  "salary": {
    "min": 110000,
    "max": 120000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "Forecast 3D",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Carlsbad, CA",
  "jobTitle": "Software Developer",
  "jobDetails": "FORECAST 3D, a leading provider of full spectrum of 3D Printing, Rapid Machining, and quick-turn tooling solutions for producing the highest quality prototypes and batch production runs, is currently seeking a driven, self-motivated, energetic and detail oriented Software Developer in our Carlsbad, CA office. Our business is rapidly growing and we are looking for additional support in our IT department.SUMMARY:The Software Developer is a highly motivated and self-directed technologist who not only is a proficient software developer in a broad range of languages, tools, and technologies, but also expertly applies them to achieve company objectives.PRIMARY RESPONSIBILITIESThe ideal candidate has a passion for creating world class business applications and the ability and willingness to code to the full stack and data model beneath.Develops and delivers software that adheres to key architectural drivers for our critical business applications. These applications are used by our Additive division through all aspects of our product development, from sales to final production.Works with team to improve front end development standards including architecture of web components, approach to styling, and user interface standards.Creates, documents, and maintains coding standards for our business applications.Codes all aspects of software including interfacing with our custom APIs, Microsoft Graph APIs, and front-end components.When necessary, meets directly with key stakeholders to provide guidance related to usability and best approaches based on effort and risk.Applies DevOps mindset to all work and looks for ways to efficiently build, deploy, and test software for frequent releases and iterations.Demonstrated proficiency in and knowledge of C/C++, data structures, algorithms, performance, and multi-threaded programming techniquesDetailed knowledge of software design practices including modular architecture, event-driven architecture, software design patterns and object-oriented designAbility to quickly understand and work with internal and externally developed codeMatrix reporting to Global ITREQUIRED EDUCATIONMinimum Bachelor's Degree in a field related to the position or a combination of related education and work experience in the areas of application/web/systems/database development to equal four years.REQUIRED EXPERIENCEMinimum of 5 years of experience creating web-based user interfaces using HTML5, CSS3, and associated technologies.Minimum of 5 years of experience working with JavaScript, JavaScript, C#, C++Minimum of 3 years of experience working with Microsoft Graph APIs including implementing RESTful APIs.Has proven understanding of coding for security and performance through all tiers of an application.Other nice to have skills include:Experience developing business applications, analytics, and system security. PHP experience is a Plus!Before applying, please note:This is not a remote position; candidates must be able to reliably commute to the Carlsbad location. Forecast 3D is a supplier which abides by the International Traffic in Arms Regulations (ITAR). In order to be considered for this position, applicants must be either a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of StateJob Type: Full-timePay: $120,000.00 - $170,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:8 hour shiftMonday to FridayAbility to commute/relocate:Carlsbad, CA 92008: Reliably commute or planning to relocate before starting work (Required)Work Location: In personShow more  Report",
  "salary": {
    "min": 120000,
    "max": 170000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/369762/firstmark-credit-union-squarelogo-1597265865902.png",
    "name": "Firstmark Credit Union",
    "ceoName": {
      "name": "Nathanael Tarwasokono",
      "photoUrl": null,
      "__typename": "Ceo"
    },
    "headquarters": "San Antonio, TX",
    "industry": {
      "industryId": 200048,
      "industryName": "Banking & Lending",
      "sectorName": "Financial Services",
      "sectorId": 10010,
      "__typename": "EmployerIndustry"
    },
    "sector": "Financial Services",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$1 to $5 billion (USD)",
    "size": "201 to 500 Employees",
    "type": "Company - Private",
    "website": "www.firstmarkcu.org",
    "yearFounded": 1932
  },
  "jobLocation": "San Antonio, TX",
  "jobTitle": "Software Developer I",
  "jobDetails": "Job Summary:The Software Developer l will analyzes user requirements, procedures, and problems to automate processing or to improve existing computer systems, tablet, and mobile devices to present a unique customer experience. Responsible for developing, enhancing, and sustaining computer systems and mobile systems within Firstmark Credit Union and testing those systems to ensure the production of a quality product.Key Responsibilities:Meets with the stakeholders to obtain clarification, gather business requirements, build a project estimation and a plan for product delivery.Designs or writes program specifications and converts specifications into computer code.Develops and executes unit and system test plans aligned with business requirements to validate enhanced capabilities / functionality. Documents results comparing requirements to tested system.Provides technical assistance for problems of all levels by responding to inquiries regarding errors, problems, or questions with software. Develops and maintains existing code based on the development or enhancement made to the software.Maintains / upgrades existing software programs as directed.Supports the development of coding standards and adheres to best practices and security guidelines. (data integrity)Job Requirements and Qualifications:BA or BS degree in a computer-related field OR Associates degree in a computer-related field, preferred.2+ years of development working experience, required.Knowledge of Symitar PowerOn, C, C++, .Net, Java, Python and API integration, preferred.Programming concepts developing in SQL, C, C++, Java, Python, HTML5, javascript, .Net, related frameworks. Using software tools such as SDKs, API services, Microsoft’s collaboration tools, Version control software (GitLab), Integration tools (Eclipse, Visual Studio, Intellij) and an understanding of their capabilities.Intermediate knowledge of Jack Henry Symitar and its utilities.Working knowledge of Microsoft Office Tools.Understanding of Scrum and Agile practices.Ability to be responsible for the full Agile software development lifecycle including design, implement, test and maintenance.All Firstmark team members must mirror our shared values: happy, helpful, honest, humble, and hungry (driven).What’s in it for you?As an employee of Firstmark Credit Union, you will join a team of talented professionals who are passionate about teamwork, outstanding service, committed to our community and who embrace the opportunity to take charge of their careers. Check out some of our benefits!Full Time & Part Time Employee Benefits401(k)&mdash;with matching incentives up to 6%Medical, Dental, and Vision InsuranceCompetitive PayEmployee Assistance ProgramEducation AssistanceCareer DevelopmentPaid & Unpaid Volunteer OpportunitiesGenerous Paid LeaveFitness Membership DiscountsAND MORE!The San Antonio Business Journal has awarded Firstmark Credit Union 3x Best Places To Work!Job Type: Full-timeShow more  Report",
  "salary": {
    "min": 57195,
    "max": 76568,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "ESTIMATED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "Zethcon",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Lombard, IL",
  "jobTitle": "Software Development & Delivery Engineer",
  "jobDetails": "Zethcon Corporation is a growing logistics application development company providing technology and services to customers in the Supply Chain field. Founded in 1970 and family-owned; our core business has focused on the development of technology solutions to help our customers grow. The development of our proprietary Logistics System has enabled us to expand and scale our business at a rapid pace.Job Description:We are currently looking for a DevOps Engineer with a focus on Oracle, Linux and automation. You will be part of a DevOps team that manages code, develops new solutions for delivering and upgrading custom software using tools like Github Actions, Ansible and Node.js. Troubleshoot and provide technical support to custom environments in Linux and Windows. Some of the software/systems you should be very familiar with include the following: Oracle, Linux, Shell Scripting, Node.js, NPM, Git, Github Actions, Ansible, Jenkins and more. You will also be involved in scheduled deployments, Oracle upgrades and troubleshooting updates that are made to custom environments. We are an established company growing at a rapid pace. If you like problem solving, software development and working in the Chicagoland suburbs you will love working at Zethcon. This position will be in office 2 days a month now. Our office is in Lombard, IL.Qualifications:Linux, Shell Scripting (Bash)Node.js / NPM or similar (Java, C++, Javascript)SQLOracle 11g and 19c is a PLUSGit (in depth)Github ActionsAnsibleRestful APICode Delivery and ExecutionFundamentals of CI/CDAbility to troubleshoot issues like database locks or application locks (Windows and Linux)Strong customer serviceExcellent analysis and problem-solving skillsB.S. or equivalent degree in Computer Science or Software Engineering is desiredCandidates must be legally authorized to work in the U.S. without sponsorshipResponsibilities:Develop and Maintain Code Delivery Systems. (Github Actions, Ansible)Execute the code delivery and upgrade of the following based systems: Web, Linux(C), Oracle(SQL) and Windows Desktop ApplicationsCollaborate with the team to deliver quality code and troubleshoot issuesProvide technical support for customer production issuesBenefits:We value our employees’ time and efforts. In exchange for your hard work and dedication, we offer an excellent salary and benefits package including paid time off, medical, dental and vision benefits as well as future growth opportunities within the company. We work to maintain the best possible environment for our employees, where people can learn and grow with the company. We strive to provide a collaborative, creative environment where each person feels encouraged to contribute to our processes, decisions, planning and culture. Flexible and casual work environment.Job Type: Full-timeJob Type: Full-timePay: $90,000.00 - $120,000.00 per yearBenefits:401(k)Dental insuranceFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offTuition reimbursementVision insuranceSchedule:8 hour shiftEducation:Bachelor's (Preferred)Experience:working in a Linux environment: 5 years (Required)Build automation: 3 years (Required)programming experience Java, C++, Javascript or similar): 3 years (Required)Shell scripting: 3 years (Required)database/sql: 3 years (Required)Work Location: In personShow more  Report",
  "salary": {
    "min": 90000,
    "max": 120000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/1123003/society-for-mining-metallurgy-and-exploration-squarelogo-1510590722437.png",
    "name": "Society for Mining, Metallurgy & Exploration",
    "ceoName": {
      "name": "David Kanagy",
      "photoUrl": null,
      "__typename": "Ceo"
    },
    "headquarters": "Englewood, CO",
    "industry": {
      "industryId": 200085,
      "industryName": "Mining & Metals",
      "sectorName": "Energy, Mining & Utilities",
      "sectorId": 10019,
      "__typename": "EmployerIndustry"
    },
    "sector": "Energy, Mining & Utilities",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$5 to $25 million (USD)",
    "size": "1 to 50 Employees",
    "type": "Nonprofit Organization",
    "website": "www.smenet.org",
    "yearFounded": 1957
  },
  "jobLocation": "Englewood, CO",
  "jobTitle": ".Net Software Developer (Full Stack)",
  "jobDetails": "Are you looking for an opportunity for advancement in a collaborative work environment that offers work-life balance and excellent benefits? The Society for Mining, Metallurgy & Exploration Inc. (SME) hires and rewards great people who are passionate about serving our members. We offer competitive compensation and benefits as well as distinctive benefits like a Safe Harbor 401(k) and Company Match 401(k) plan, flexible work schedules including a 9/80 Work Schedule, and Winter Break from December 24th – January 1st.SME, www.smenet.org, is a scientific and technical society (501(c) (3) corporation) whose more than 13,000 members globally in more than 100 countries. SME members include engineers, geologists, metallurgists, educators, students and researchers focused on innovations in mining engineering. SME nurtures a professional community, develops technical content, and provides networking and educational opportunities for the mining industry.TITLE: .Net Software Developer (Full Stack)DEPARTMENT: Web DevelopmentWORK TYPE: Full-Time ExemptLOCATION: 12999 E. Adam Aircraft Circle; Englewood, CO 80112PAY RANGE: $70,000 - $90,000 DOEBONUS: 8% bonus potential based upon achievement of defined goals401(K): 3% automatic safe-harbor match plus 80% elective deferral match of the first 5% contributed by the employeeBENEFITS: Medical, Dental, Vision, FSA or HSA*, Short-Term Disability Insurance, Employer Paid Life Insurance, Employer Paid Long-Term Disability, Travel Assistance, and EAP. Sick, Vacation, and Holidays including Winter Break office closure from 12/24-1/1.SCHEDULE:Hybrid work schedule – This position is required 2 days in the office, up to 3 days Remote.Flexible Work Schedule Options including, flexible start times from 6:00am – 9:00am.Traditional workweek or 9/80 schedule available.SUMMARYResponsible for the development and maintenance of system software independently or under the direction of a Senior Software Developer or System Architect.Apply your knowledge of SDLC concepts to a structured process that enables the production of high- quality, low-cost software, in the shortest possible production time. The right candidate will bring their experience with best practices, an understanding of new and evolving technologies, and the ability to derive comprehensive requirements while uncovering dependencies. This role will require that you bring your expertise to our effective team environment to develop clean well-documented code that addresses business requirements with a keen eye toward reusable components.Relies on experience, judgment, and established procedures to design and implement software solutions using independent thinking, team collaboration, creativity, and a great can-do attitude.Job Responsibilities:Software/Application DevelopmentDesign system interfaces and prepare associated diagrams/documentation.Create web-based user interfaces.Develop internal and customer reports.Create data access components and stored procedures.Participate in the development and adoption of standards and procedures.System SupportConfigure/Administer desktop applications.Monitor system status and performance.Support requested data retrievals.Perform database analysis and administration tasks.Assist with system upgrades.Troubleshoot system issues as part of Tier 3 support.AdministrativeRecord time spent on assigned projects and tasks (weekly).Mentor and manage sub-projects and tasks.Prepare status reports, as required by specific projects.Required Skills/Qualifications:3 Years of Experience with:C#, ASP.NET MVC.MS SQL Server (queries and stored procedures).UI experience to include Bootstrap, HTML, JavaScript, jQuery & CSS.Object-oriented design and programming experience.Common version control and team collaboration methods and tools (Visual Studio, Git, Teams, and Zoom).General IT troubleshooting skills and regression testing techniques.Required Skills:Ability to communicate effectively with team members and vendors to accomplish internal goals.Self-motivated and self-directed.Strong verbal and written communication skills.Detail-oriented with strong organizational and analytical skills.Preferred Experience:AngularWordPressPHPBootstrapBachelor’s degreeASP.NET CORE v6Azure Cloud EnvironmentDevExpress (MVC/CORE)Kentico CMSWeb ServicesThe above qualifications and requirements are representative, but not all-inclusive, of the knowledge, skills, and abilities required for the position.Please submit a cover letter expressing why you are interested in this particular position, including how your experience is related to the duties of the position and a resume. No relocation expenses provided.EOE/Minorities/Females/Veterans/DisabledJob Type: Full-timePay: $70,000.00 - $90,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible scheduleFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceReferral programRetirement planVision insuranceCompensation package:Performance bonusExperience level:3 yearsSchedule:8 hour shiftAbility to commute/relocate:Englewood, CO 80112: Reliably commute or planning to relocate before starting work (Required)Experience:Microsoft SQL Server: 3 years (Preferred)ASP.NET: 3 years (Required)C#: 3 years (Preferred)Work Location: Hybrid remote in Englewood, CO 80112Show more  Report",
  "salary": {
    "min": 70000,
    "max": 90000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "XcelaStream",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Manassas, VA",
  "jobTitle": "Director of Software Engineering",
  "jobDetails": "XcelaStream, Inc. (XCS) has developed a multi-patented technology platform that optimizes personal cloud computing. The startup was formed in 2019 as a spin-out from NCS Technologies, Inc., to further develop and commercialize its cutting-edge product. Founded in 1996, NCS is a systems integrator and manufacturer of specialized computing and storage devices.Our patented technologies will enable a low-latency, high-frame rate, high-resolution, and full-featured user experience on the simplest end-user devices. The solution’s downstream financial impact is massive as it can enable the use of the low-cost “zero client” computers (such as the Raspberry Pi 4) with the equivalent quality and functionality of a high-end, Windows-based “thick client”.With the continued support of NCS and future institutional investors, we will build a world-class technical team, working with an array of innovative technologies involving FPGA, GPU, AI, virtualization, cloud/edge computing, 5G, and video codecs. This is an exciting opportunity to become an early and valued contributor to the team, tackling unique challenges within the personal cloud computing world. Therein, you get the best of both worlds - the potential upside of a high-flying, 1st mover startup combined with the backing of an established company.At XCS, we are committed to investing in our most prized asset – our employee base – with a broad range of benefits, education, training as well as a flexible work environment (a hybrid approach to remote and on-site).Our Vision – To make rich personal cloud computing everywhere a realityOur Mission – To enrich virtual personal computing on the simplest end-user devices with cloud-2-edge acceleration technologiesWho Are We Looking for:We are seeking a Director of Software Engineering (DSE) who is passionate about applying his/her skills and experience to do innovative work in a new frontier in cloud personal computing. This candidate will lead our software engineering team and should have experience in agile development. The candidate will report directly to our CTO.Job Summary:The DSE will lead our software development effort and work closely with our CTO in building out the rest of our tech stack. In this job, the DSE will assemble, lead, manage, and grow a team of software engineers. In addition, the DSE will also be involved in collaborating directly with third parties (such as partners and customers) to successfully deploy our solution(s).Your Responsibilities:· Build and manage our software engineering team· Have the vision, passion, and drive to develop a top performing engineering organization· Plan and coordinate the work of engineering staff (and lead code reviews)· Recruit additional engineering staff as needed· Conduct performance evaluations that are timely and constructive· Provide training and mentoring as needed· Actively engage with the CTO and PM to develop products from concept to testing to production· Conduct hands-on R&D if necessary· Manage code repositories· Develop and manage CI/DI workflows· Collaborate on agile development themes, epics, user stories· Oversee progress and timeliness of development projects· Ensure development sprints are on schedule and within budgetYour Skills:· Excellent written and verbal communication skills· Comfortable talking with partners and customers· Excellent hands-on managerial and supervisory skills· Excellent analytical and problem-solving skills· Extensive technical knowledge of engineering and coding· Proficient in agile methodologies, Git-based & Open-source workflows, CI/CD pipeline, DevOps, platform engineering· Experienced with networking protocols and tools (HTTPs, TCP, QUIC, Wireshark)· Experienced with various programming languages and frameworks (C/C++, JavaScript, Web Assembly, Podman, Kubernetes, and microservices architecture). Also, prior knowledge of Rust (or interest in learning) is a requirement.· Experienced with modern SQL and NoSQL databases· Knowledgeable about x86, ARM, PCIe, Linux, Windows, and their device driver architectures· Knowledgeable about cloud computing platforms and tools (AWS, Azure, Google Cloud)· Familiar with VDI technologies (VMware Horizon, RDP, PCoIP)Education and Experience:· Bachelor’s or Master’s degree in Computer Science, Applied Mathematics, or Electrical Engineering required· At least 10 years of related experience required· VDI technologies (VMware Horizon, RDP, PCoIP): 2 years (Preferred)· system (SW + HW) development management: 1 year (Required)· Software development: 5 years (Required)· Software engineering management: 5 years (Required)· Experience working for a small software company is a big plusHQ Location: Our corporate HQ is based in Manassas, VA - just south of Washington, DC. This is a hybrid position which requires some travel to HQ to work in-person with the CTO (with the potential for re-location, if interested).Job Type: Full-timePay: From $160,000.00 per yearBenefits:Flexible schedulePaid time offSchedule:8 hour shiftMonday to FridayWeekend availabilityAbility to commute/relocate:Manassas, VA 20109: Reliably commute or planning to relocate before starting work (Required)Experience:VDI technologies (VMware Horizon, RDP, PCoIP): 2 years (Preferred)System (SW + HW) development management: 1 year (Required)Software development: 5 years (Required)Software engineering management: 5 years (Required)Work Location: Hybrid remote in Manassas, VA 20109Show more  Report",
  "salary": {
    "min": 160000,
    "max": 160000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/136736/paycom-squarelogo-1438349479876.png",
    "name": "Paycom Payroll Llc",
    "ceoName": {
      "name": "Chad Richison",
      "photoUrl": "https://media.glassdoor.com/people/sql/136736/paycom-chad-richison.png",
      "__typename": "Ceo"
    },
    "headquarters": "Oklahoma City, OK",
    "industry": {
      "industryId": 200061,
      "industryName": "Enterprise Software & Network Solutions",
      "sectorName": "Information Technology",
      "sectorId": 10013,
      "__typename": "EmployerIndustry"
    },
    "sector": "Information Technology",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$1 to $5 billion (USD)",
    "size": "1001 to 5000 Employees",
    "type": "Company - Public",
    "website": "https://www.paycom.com",
    "yearFounded": 1998
  },
  "jobLocation": "Oklahoma City, OK",
  "jobTitle": "Application Security Analyst",
  "jobDetails": "The Application Security Analyst position exists to protect the security posture of the Paycom application through tasks such as web application penetration testing, code review, tool use, and other measures. Additional tasks include work to develop or improve existing projects that contribute to application security, and user education.\nRESPONSIBILITIES\nPerform web penetration test assessments on company applications and APIs.\nAnalyze and report on findings from penetration tests to leadership and Development.\nPerform code review of application source code for security vulnerabilities.\nAnalyze and report on findings from code review to leadership and Development.\nCommunicate with developers to explain security findings and suggested remediation.\nCommunicate with developers to find solutions to meet business and security requirements.\nResearch the security of 3rd party tools, software libraries, APIs, etc.\nWork with various security scanning tools to assess the security posture of the Paycom application and report on findings.\nContribute to the creation, maintenance, and improvement of documentation around security, policies, standards, guides, and procedures where applicable.\nEducation/Certification:\nBachelor's or Master’s Degree in Management Information Systems, Computer Science or Cyber Security.\nIndustry Certification (GWAPT, GCIH, etc.) preferred.\nExperience:\nEntry level position.\nSkills/Abilities:\nBasic understanding of the OWASP Top 10 vulnerabilities list; ability to list and discuss items from the Top 10.\nGeneral knowledge of information security principles and practices.\nExperience with one or more programming/scripting languages highly recommended: PHP, Python, C#, Java, C++, C, JavaScript, React\nBasic experience with the following technologies is recommended but not required: SQL (MySQL/MSSQL/Postgres), NoSQL, HTML, CSS\nBasic experience with the following operating systems is recommended but not required: Linux distributions (Ubuntu, Kali Linux, Debian, Red Hat), iOS (current versions), Android OS (current verions), macOS (current versions)\nStrong analytical and problem solving skills.\nStrong verbal and written communication skills.\nPaycom is an equal opportunity employer and prohibits discrimination and harassment of any kind. Paycom makes employment decisions on the basis of business needs, job requirements, individual qualifications and merit. Paycom wants to have the best available people in every job. Therefore, Paycom does not permit its employees to harass, discriminate or retaliate against other employees or applicants because of race, color, religion, sex, sexual orientation, gender identity, pregnancy, national origin, military and veteran status, age, physical or mental disability, genetic characteristic, reproductive health decisions, family or parental status or any other consideration made unlawful by applicable laws. Equal employment opportunity will be extended to all persons in all aspects of the employer-employee relationship. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, training, promotion, discipline, compensation benefits, and separation of employment. The Human Resources Department has overall responsibility for this policy and maintains reporting and monitoring procedures. Any questions or concerns should be referred to the Human Resources Department. ****To learn more about Paycom's affirmative action policy, equal employment opportunity, or to request an accommodation - Click on the link to find more information: paycom.com/careers/eeocShow more  Report",
  "salary": {
    "min": 65793,
    "max": 93584,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "ESTIMATED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/913/jacobs-squarelogo-1574653848502.png",
    "name": "Jacobs",
    "ceoName": {
      "name": "Bob Pragada",
      "photoUrl": "https://media.glassdoor.com/people/sql/913/jacobs-ceo1678161248887.png",
      "__typename": "Ceo"
    },
    "headquarters": "Dallas, TX",
    "industry": {
      "industryId": 200023,
      "industryName": "Architectural & Engineering Services",
      "sectorName": "Construction, Repair & Maintenance Services",
      "sectorId": 10007,
      "__typename": "EmployerIndustry"
    },
    "sector": "Construction, Repair & Maintenance Services",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$10+ billion (USD)",
    "size": "10000+ Employees",
    "type": "Company - Public",
    "website": "www.jacobs.com",
    "yearFounded": 1947
  },
  "jobLocation": "Auburn Hills, MI",
  "jobTitle": "Building Controls Infrastructure Engineer",
  "jobDetails": "We’re always looking for dynamic and engaged people to join our team – built on a culture of inclusion where all perspectives are embraced. Bring your passion, your ingenuity and your vision. Let’s see the impact we can create, together.​The Building Automation Systems Infrastructure Engineer will work with other System Infrastructure Engineers and Engineers/Skilled trades to keep the Building Automation System operational at all times.We are looking for a candidate with a positive attitude and enthusiasm for learning. We will hire and train the right candidate.Some of the functions of the Building Automation System Infrastructure Engineer will be:Candidate must be willing to learn new skills to supplement their current knowledge and be motivated to figure out how to solve problemsParticipate in the daily work routine as necessary.Responsible for maintaining and upgrading a large Johnson Controls Metasys Distributed Digital Controls System to current technology.Your job duties as a Computer System Infrastructure Engineer include:overseeing system upkeepidentifying and justifying upgrades to the infrastructuretriage product or system issues and debug/track/resolve them.developing new applications (writing system development code),database mining and reporting (including building platforms to aggregate data from multiple sources),participating in/leading design reviewsreviewing code developed by ther developers.In addition, you will provide support in maintaining, troubleshooting and upgrading of the Building Automation System for a 5.5M sqft facility R&D facility.Must be able to document changes and maintain configuration control for the code and drawings as applicable.Attendance is critical – normal 40 hour work week but some overtime may be required (supporting a 24X7 operation).Must be willing to provide afterhours support when/if necessaryMust be proficient in using a computer/network.Willing to work and glean knowledge from the current Building Automation System Infrastructure EngineerQualifications - ExternalThe Building Controls System Engineer Candidate will have:Minimum qualifications:A BS in Computer Science from an ABET certified school with experience working on Databases, Web interfacesAbility to multitask and work on own with direction, be self-motivated.Must be an excellent communicator, both written and orally.Have experience with software programming (e.g., Java, JavaScript, Python, C, HTML), serialized data (e.g., JSON, XML).Have experience in systems design and architecting complex systems interactions, including data flows, common interfaces, and APIs.Have experience building platforms or pipelines to aggregate data from multiple sources.Have experience in architecting and writing databases or analytics code (e.g., data pipelines).Have experience with dashboard creation and data querying.Preferred qualifications:Have experience in leading application modernization projects or application architecture projects.Have experience with implementing and project managing large-scale software projects in corporate environments.Have experience with capacity planning for technical infrastructureHave experience developing web services and micro-servicesHave experience with detailed network security and system design of load balancers, firewalls, and VPN in the deployment of virtual machines and containerized applications.Have experience organizational, problem solving, and influencing skills.Have experience written and verbal communication and presentation skills.Have passion for engineering excellence and ample experience with unit testing and agile project developmentJob Type: Full-timePay: $70,000.00 - $90,000.00 per yearBenefits:401(k) matchingDental insuranceEmployee assistance programHealth insuranceHealth savings accountLife insurancePaid time offTuition reimbursementVision insuranceSchedule:8 hour shiftDay shiftMonday to FridaySupplemental pay types:Signing bonusApplication Question(s):What is your desired salary range?Do you now or in the future require sponsorship to work in the US?Work Location: In personShow more  Report",
  "salary": {
    "min": 70000,
    "max": 90000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/2016040/dci-solutions-squarelogo-1535626536894.png",
    "name": "DCI Solutions",
    "ceoName": null,
    "headquarters": "Aberdeen, MD",
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "Unknown / Non-Applicable",
    "size": "1 to 50 Employees",
    "type": "Contract",
    "website": "www.dci-solutions.com",
    "yearFounded": null
  },
  "jobLocation": "Herndon, VA",
  "jobTitle": "Software Security Engineer",
  "jobDetails": "DCI Job Requirement for:Software Security EngineerLocations: Herndon, VAJob Description:Serves as Software Security Engineer for DoD Cyber ProjectProvides expertise of DoD systems cyber security standards (DoDI 8570.01-M)Provides expertise to support secure software w/ DoD/Army cyber security policyProvide guidance on STIGs for software to be within Army complianceCaptures and refines information security requirementsDesigns, and implements security architecture for new/existing applicationsSoftware infrastructureCustom software apps, OS’s, and COTs productsSecure designSecure architectureSecure coding techniquesProvides technical consultation to the development team IPT on:Security design processcomplex information security architecturesUpgrades to legacy systems.Qualifications:BS in Computer Science (or equivalent)Expert ability with back-end programming languagesJava, SQL, C#, Python, Ruby, etcExpert ability with front-end web programming languagesHTML, JavaScript, CSS, Angular JS, etcExperience with common web development tools and servicesEx. Version control software, package managers, CI/CD pipelines8570 IAT Lvl III (CSSLP, CISSP, or CASP)CISSP-ISSEP, CISSP-ISSAP (Preferred)Able to be onsite 5 days/weekActive DoD Top Secret ClearanceJob Type: Full-timeSalary: $150,000-$200,000Job Type: Full-timePay: $150,000.00 - $200,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible scheduleHealth insuranceHealth savings accountLife insurancePaid time offParental leaveProfessional development assistanceReferral programRelocation assistanceRetirement planTuition reimbursementVision insuranceCompensation package:1099 contractBonus payPerformance bonusRetention bonusSigning bonusYearly paySchedule:Monday to FridayExperience:Python, Java, and C: 5 years (Preferred)CSS, HTML, JavaScript: 5 years (Preferred)software engineering: 5 years (Preferred)cybersecurity: 4 years (Preferred)STIGing: 3 years (Preferred)License/Certification:CISSP, CASP, or CSSLP (Preferred)Security clearance:Top Secret (Required)Work Location: In personShow more  Report",
  "salary": {
    "min": 150000,
    "max": 200000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/31513/scot-forge-squarelogo-1425472878986.png",
    "name": "SCOT FORGE",
    "ceoName": {
      "name": "John Cain",
      "photoUrl": null,
      "__typename": "Ceo"
    },
    "headquarters": "Spring Grove, IL",
    "industry": {
      "industryId": 200073,
      "industryName": "Machinery Manufacturing",
      "sectorName": "Manufacturing",
      "sectorId": 10015,
      "__typename": "EmployerIndustry"
    },
    "sector": "Manufacturing",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$100 to $500 million (USD)",
    "size": "501 to 1000 Employees",
    "type": "Company - Private",
    "website": "www.scotforge.com",
    "yearFounded": 1893
  },
  "jobLocation": "Spring Grove, IL",
  "jobTitle": "IT BUSINESS SYSTEMS ANALYST - MANUFACTURING",
  "jobDetails": "IT BUSINESS SYSTEMS ANALYST - MANUFACTURINGEmployee-Owned Company - Build Your Career - Premier Company – Great PeopleWould you like to take your IT career to the next level? Do you like creating business solutions that are user friendly? Do you commitment and drive to become an employee owner of an employee owned company?We offer you……..LONG TERM CAREERAWESOME BENEFITSCOMPANY WIDE PROFIT-SHARING BONUS PLANESOP - EMPLOYEE STOCK OWNWERSHIP PLAN (A QUALIFIED RETIREMENT PLAN)Scot Forge is a 100% employee-owned company that manufactures custom open die and rolled ring forgings.Position Summary:The IT Business Systems Analyst – Manufacturing would be primarily responsible for system selections, implementations, and change management of our many manufacturing and quality systems. This full time ownership position will work collaboratively with our Operations, Quality, Metallurgy, and Engineering functions. In addition, this role will be on the cutting edge of predictive analytics, machine learning, and Information Technology solutions for our internal customers. .Experience SQL, C++. C Sharp, JavaScript, Python are very helpful.Essential Responsibilities:Serve as a trusted business partner to deliver thought leadership and overall global designsLead the identification of user requirements and deliver cutting edge technology capabilitiesLead change management as part of the implementation processLearn several new applications manufacturing and quality applicationsStay focused on projects that are aligned to company KPI’s such as quality, on-time delivery, cost reduction, capacity improvement, and eliminating customer pain pointsProvide the business owners the information required for them to make educated decisions regarding system changes, including defining overall scope, work effort, weighing the risk to change, the time to change, and the benefits gained by the changeFocus on the inputs and outputs of the Saw, Forge, Heat Treat, Machining, Inspection, Quality Control, Met Lab, Production Control and Product Certification teams to improve their individual department metrics and substantially improve overall company results of Quality, on-time delivery and other company measures.Learn and apply deep functional understanding of manufacturing IT systems and apply thought leadership and innovative technology solutions.Participate in the scoping and design of the next generation manufacturing workflow and technology solutions by either enhancing our current systems or developing new systems.To create a knowledgebase to future owners on our main manufacturing systems such as JDE, Met Lab systems, Solidworks, furnace and press technology, Mastercam, bar coding technology, reporting analytics, and much moreQualifications:Business or manufacturing experience (2-4 years)SQL, C++. C Sharp, JavaScript, Python, etc.Strong collaboration skills and the ability to work with various types of people in our cultureStrong “customer first” mentalityBachelor’s degree in Business Management, Information Technology, Supply Chain, Operations Technology or Related FieldKeeping an open mind to what our front-end system should be in the futureHave a skillset, mindset, toolset approach. Skillset- meaning building technical knowledge and experience to advance us to the future. Mindset- a willingness to engage constructively with our business owners. Toolset- designing and developing strong applications for our business owners.Display a continuous improvement mindset by always looking for global, broad-based changes rather than focusing on spot solutionsSeek knowledge from trusted advisors both inside and outside the company to improve personal effectivenessLeverage intellectual horsepower and creativity to devise innovative solutionsExhibit internal drive to personally grow into a long-term larger role with management responsibilitiesBenefits of Employee Owners:A few of our amazing benefits include...Employee Stock Ownership PlanIncentive bonus and profit sharingMedicalDentalVisionPrescription Drug Plan & FSA401KPaid vacation and holidaysShort and Long Term DisabilityLife InsuranceTuition ReimbursementCompany sponsored life insuranceInvestment in personal career development and learningFun social events with your other owners such as outdoor activities like golf, canoeing, picnics and more.At Scot Forge, we help our customers succeed in their most critical initiatives with forged solutions for everything from the world's physical infrastructure, energy and transportation to manufacturing, mining, and our national defense. From the wheels of NASA's Curiosity Mars Rover to mission critical components for nuclear submarines, to large hydraulic cylinders for the largest mining trucks on the planet, Scot Forge creates the precision forged metal parts used in demanding applications all over the world.Additional Requirements:Must be able to work on-site at in Spring Grove, IL on a full-time basis.Must be authorized to work anywhere in the U.S. without sponsorship.We are proud to be an Equal Employment Opportunity employer: M/ F/ Disabled/ Vets encouraged to apply.We maintain a drug-free workplace and perform pre-employment substance abuse testing.Job Type: Full-timePay: From $50,000.00 per yearExperience level:1 yearSchedule:8 hour shiftWork Location: In personShow more  Report",
  "salary": {
    "min": 50000,
    "max": 50000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/1197512/fusion-medical-staffing-squarelogo-1597184824338.png",
    "name": "Fusion Medical Staffing",
    "ceoName": {
      "name": "Steve Koesters",
      "photoUrl": null,
      "__typename": "Ceo"
    },
    "headquarters": "Omaha, NE",
    "industry": {
      "industryId": 200059,
      "industryName": "Health Care Services & Hospitals",
      "sectorName": "Healthcare",
      "sectorId": 10012,
      "__typename": "EmployerIndustry"
    },
    "sector": "Healthcare",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "Unknown / Non-Applicable",
    "size": "201 to 500 Employees",
    "type": "Company - Private",
    "website": "www.fusionmedstaff.com",
    "yearFounded": 2009
  },
  "jobLocation": "Omaha, NE",
  "jobTitle": "Senior Front-End Developer, React",
  "jobDetails": "FLSA Status\nExempt\n\nSalary Range\n$80,000-$120,000 + incentive bonus of up to 10% of base salary\n\nExact compensation may vary based on skills and experience.\n\nJob Family\nTechnology Development\n\nWorkplace Type\nLocal, Hybrid, Remote\n\n\n**Fusion Medical Staffing does not offer Visa Sponsorship at this time**\n\nOverview: Fusion Medical Staffing is searching for a Senior Front-End Developer, React to join our growing Technology team. As a Senior Front-End Developer, React you will participate in all aspects of the Agile software development lifecycle which includes estimating, technical design, implementation, documentation, testing, deployment, and support of application developed.\n\n\nAt Fusion Medical Staffing, our core purpose is to ensure that everyone we touch has a better life. Working at Fusion means being part of an energizing, fulfilling environment that has been recognized as one of the best places to work in the community and the healthcare industry. We strive to stay true to our core values – being humble, driven, and positive while empowering healthcare professionals to build their dream careers.\n\n\nWhy would you settle for any old job? Fusion believes in authenticity, integrity, determination, and a positive attitude to help you grow into a truly great career here.\n\n\nYou want to do great things? We do too!\n\nLet’s do them together.\n\n\nWhat You’ll Work on:\n\nFusion Marketplace - A staffing recruitment platform where healthcare travelers are in control. Healthcare travelers now have more career, agency, recruiter, and lifestyle choices in one convenient location. Unknowns known.\n\n\nEssential Functions:\n\nPassionate about creating beautiful code using modern tools and techniques\nBuild end to end features on iOS and Android mobile applications from design to deploy\nCommitted to deliver results as part of an agile team\nDedicated to self-improvement and interested in learning new things\nWillingness to mentor developers in code quality, robustness, and scale\nDriven to work smarter, not harder by optimizing and automating functionality\n\n\nCompetencies:\n\nProficiency in English language (oral and written\nExcellent communication and people skills\nDetail oriented\nHumble, Driven, Positive\nStrong organizational and time management skills\nComputer skills\nExhibit a high level of personal accountability\nResults driven mentality\n\n\nWork Environment:\n\nThis job operates as a hybrid position in an office and/or remote environment and routinely uses standard office equipment.\n\n\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job, with or without accommodation.\n\nEmployee is regularly required to talk and hear\nConstantly operates a computer and other office equipment, such as a phone, headset, calculator, copier, and printer\nThe person in this position may need to occasionally move about inside the office to access files, computer equipment, copier, etc.\n\n\nPosition Type/Expected hours worked:\n\nThis is a full-time position, and hours of work and days are Monday through Friday, 8:00 a.m. to 5 p.m. CST (flexible start/end times with manager discretion). Regular and punctual attendance is required\n\n\nRequired Education and Experience:\n\n4+ years of software development experience with ReactJS, with a deep understanding of JavaScript, HTML, and CSS\nExperience with web application development frameworks and tools like React, Redux, Express, webpack\nSolid understanding of mobile UI/UX best practices and standards\nExperience designing application structure and architecture\nDeep understanding of state management\nUnderstanding and comfortable with designing and using API’s like REST\nExcellent communication and collaboration skills\nGreat customer empathy that makes user experience a top priority\nExperience developing software in a fast-paced agile environment\n\n\nPreferred Education and Experience:\n\nExperience building mobile apps with React, including native modules\nFamiliar with cloud infrastructure (Azure, AWS, or Google Cloud Services)\nExperience using an IDE such as Visual Studio\nFoundational knowledge of SQL\nExperience with Test Driven Development and Acceptance Test Driven Development\nExperience with modern authentication using OAuth 2.0, SAML, JWT\nExperience with .NET in an enterprise environment\nExperience with Docker and Kubernetes\nExperience developing native Objective-C / Swift iOS or Java Android applications\n\n\nWhat we offer:\n\nBEST IN CLASS - Medical, dental and vision insurance to keep you and your family healthy\nFunding into Health Savings Accounts\nPaid time off for medical and parental leave\nSupport for family planning, including adoption and surrogacy assistance\nCompetitive 401(k) retirement plan with company match\nCompany paid Short Term Disability/Long Time Disability and Life Insurance\nHonor Paid Time Off - blended vacation and sick time to allow for flexible time-off\nFusion Profit Sharing incentive\nIn-office and/or hybrid/remote work schedule with computer equipment set up for home\nUp to $500 stipend for cell phone and internet\nReimbursement for wellness items and activities\nLearning and development reimbursement\nEmployee Assistance Program (Employer paid)\nCompany events\nVolunteer and Community Engagement opportunities\nPaid company holidays: New Year's Day, Memorial Day, Juneteenth, Independence Day, Labor Day, Thanksgiving, Black Friday, Christmas Eve (noon dismissal), and Christmas Day\n\n\nOther Duties:\n\nThis job description is not a comprehensive list of all activities, duties or responsibilities that are required of the employee for this job and is subject to change at any time with or without notice.Show more  Report",
  "salary": {
    "min": 80000,
    "max": 120000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/1496026/ondek-solutions-squarelogo-1498139804051.png",
    "name": "OnDek Solutions",
    "ceoName": null,
    "headquarters": "Saddle River, NJ",
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "Unknown / Non-Applicable",
    "size": "1 to 50 Employees",
    "type": "Company - Private",
    "website": "www.ondeksolutions.com",
    "yearFounded": null
  },
  "jobLocation": "Dulles, VA",
  "jobTitle": "Mobile Test Engineer",
  "jobDetails": "We are looking to hire a Test Engineer with a Top Secret clearance (ability to upgrade to TS/SCI with Poly) in Dulles, VA.The team writes CNO software for mobile devices (both Android and iOS) as part of a larger program providing multi-platform support of ongoing operational missions. You get to see the software you write get put into action. You know who is using it, on which missions, and what impact your work is having. You have a ringside seat to the action. The work is very close to the devices and the hardware/software interface. You'll find mobile devices, embedded systems, linux kernels, OS internals, networking, etc. Languages used depend on the specific operational mission being supported and often include, C, C++, Python, and JavaScript. Overall, there is room for a LOT of creativity in how to solve problems. The environment is fast-paced, with turnaround times being measured in weeks, but without the knee-jerk changes of focus that some projects have.Work on this program takes place in the Dulles, VA area (cannot support remote work) and requires a Top Secret clearance.Required Skillsfamiliarity with end-to-end test processesexperience writing test plans and procedurestest scripting experienceDesired Skillstesting mobile devicesJob Type: Full-timePay: $125,000.00 - $150,000.00 per yearBenefits:401(k)Dental insuranceFlexible spending accountHealth insuranceHealth savings accountLife insurancePaid time offParental leaveProfessional development assistanceReferral programTuition reimbursementVision insuranceCompensation package:Yearly payExperience level:4 yearsSchedule:8 hour shiftAbility to commute/relocate:Dulles, VA: Reliably commute or planning to relocate before starting work (Required)Experience:writing test plans: 4 years (Required)end to end test processes: 4 years (Required)testing mobile devices: 4 years (Required)C, C++, JavaScript, or Python: 4 years (Required)Android or iOS: 4 years (Required)Security clearance:Top Secret (Required)Work Location: In personShow more  Report",
  "salary": {
    "min": 125000,
    "max": 150000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/4138/accenture-squarelogo-1603988625135.png",
    "name": "Accenture",
    "ceoName": {
      "name": " Julie Sweet",
      "photoUrl": "https://media.glassdoor.com/people/sql/4138/accenture-ceo1568895575013.png",
      "__typename": "Ceo"
    },
    "headquarters": "Dublin, Ireland",
    "industry": {
      "industryId": 200028,
      "industryName": "Business Consulting",
      "sectorName": "Management & Consulting",
      "sectorId": 10006,
      "__typename": "EmployerIndustry"
    },
    "sector": "Management & Consulting",
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "$10+ billion (USD)",
    "size": "10000+ Employees",
    "type": "Company - Public",
    "website": "www.accenture.com",
    "yearFounded": 1989
  },
  "jobLocation": "Arlington, VA",
  "jobTitle": "Federal - Microsoft Senior Developer",
  "jobDetails": "We are: Accenture Federal Services, a wholly owned subsidiary of Accenture LLP, is a U.S. company with offices in Arlington, Virginia. Accenture's federal business has served every cabinet-level department and 30 of the largest federal organizations. Accenture Federal Services transforms bold ideas into breakthrough outcomes for clients at defense, intelligence, public safety, civilian and military health organizations.\n\nWe believe that great outcomes are everything. It is what drives us to turn bold ideas into breakthrough solutions. By combining digital technologies with what works across the world’s leading businesses, we use agile approaches to help clients solve their toughest problems fast—the first time. So, you can deliver what matters most.\n\nCount on us to help you embrace new ways of working, building for change and put customers at the core. A wholly owned subsidiary of Accenture, we have over 30 years of experience serving the federal government, including every cabinet-level department. Our 13,000 dedicated colleagues and change makers work with our clients at the heart of the nation’s priorities in defense, intel, public safety, health and civilian to help you make a difference for the people you employ, serve, and protect.\nYou are: An inventor and a problem-solver. Curious and future-focused, you are always looking to dive deep into innovative technologies and meaningfully apply them. But talking tech is only your second language. You rise above and beyond to constantly finding better ways for our government to work.\nThe Work:\nDesign and implement highly complex Microsoft Dynamics and Power Platform based business solutions.\nLead meetings with customer/partners to understand business needs, and proactively manage executive-level customer expectations.\nImplement, configure, and customize the Dynamics/Power Platform and Portal/Power Pages.\nLeverage Power Platform and other means to integrate into Azure services is desired\nLead medium to large teams, meetings, collaborate with internal stakeholders.\n\nHere what you need:\nExpertise in C# Programming Language, JavaScript\nExperience developing full model-driven applications in Microsoft Dataverse (or Dynamics 365, PowerApps)\nExperience in implementing Dynamics 365 plugins\nExperience in PowerApps configuration, customization, and form client side scripting\nExperience developing a security model in Microsoft Dataverse and/or Dynamics 365\nBonus points if:\nDemonstrated experience managing projects and leading teams\nCompensation for roles at Accenture Federal Services varies depending on a wide array of factors including but not limited to the specific office location, role, skill set and level of experience. As required by local law, Accenture Federal Services provides a reasonable range of compensation for roles that may be hired in California, Colorado, New York City or Washington as set forth below and information on benefits offered is here.\nRole Location: Range of Starting Pay for role\nCalifornia: 105,200 – 168, 400\nColorado: 105,200 – 145,500\nNew York City: 121,700 – 168, 400\nWashington 112,100 – 154,900\nWhat We Believe\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\nEqual Employment Opportunity Statement\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\nAccenture is committed to providing veteran employment opportunities to our service men and women.\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement.\nRequesting An Accommodation\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\nIf you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\nOther Employment Statements\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.Show more  Report",
  "salary": {
    "min": null,
    "max": null,
    "payPeriod": null,
    "currency": "USD",
    "source": null
  }
},
{
  "companyDetails": {
    "logo": "https://media.glassdoor.com/sql/2016040/dci-solutions-squarelogo-1535626536894.png",
    "name": "DCI Solutions",
    "ceoName": null,
    "headquarters": "Aberdeen, MD",
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": "Unknown / Non-Applicable",
    "size": "1 to 50 Employees",
    "type": "Contract",
    "website": "www.dci-solutions.com",
    "yearFounded": null
  },
  "jobLocation": "Aberdeen, MD",
  "jobTitle": "Reverse Software Engineer",
  "jobDetails": "DCI Job Requirement for: Senior Reverse Software Engineer Location: Openings in APG, MDJob Description:Provide on-site support in Research and Development of software:Designed to find vulnerabilities of:TechnologyAlgorithm DevelopmentScript, Writing, and Software Utility DevelopmentAnalysis and Reverse Engineering of:Source codeSoftware Integration and TestingTechnical Writing and DocumentationLifecycle maintenance of customer software programsCoordinate with and provide findings to AI/ML SMEs to:Improve time to discoveryIncrease automation of vulnerability discovery, characterization, and useDevelop capabilities for assisting our government partners to include:Technology ResearchVulnerability AssessmentSoftware DevelopmentCapability IntegrationSystem test and Product MaintenanceQualifications:BS in technical discipline preferred, but not requiredNOTE: Technical competency is the primary qualification in this roleRequires 3+ years of hands-on vulnerability analysis experience (Expert)10+ years’ experience for following areas:Exploit developmentLinux/Android kernel developmentLow-level operating systems for Android (Linux acceptable)Applied ARM/AARCH64 Assembly developmentJavaScript development and C programmingHands-on Reverse Engineering experience using tools such as IDA Pro, Binary Ninja and GhidraFuzzing experience (Mayhem, AFL, KLEE)NOTE: will consider right candidate without clearanceJob Type: Full-timeJob Type: Full-timePay: $170,000.00 - $220,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceEmployee assistance programFlexible scheduleHealth insuranceHealth savings accountLife insurancePaid time offParental leaveProfessional development assistanceReferral programRelocation assistanceRetirement planTuition reimbursementVision insuranceSchedule:Monday to FridayExperience:Software Engineering: 10 years (Preferred)Reverse Engineering: 5 years (Preferred)Linux/Android Kernel development: 10 years (Preferred)JavaScript and C: 10 years (Preferred)Exploit Development: 10 years (Preferred)Security clearance:Top Secret (Preferred)Work Location: In personShow more  Report",
  "salary": {
    "min": 170000,
    "max": 220000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "Bravo Team",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Mooresville, NC",
  "jobTitle": "Test Engineer",
  "jobDetails": "Are you a talented hands-on Test and Measurement Engineer looking for a non-corporate work environment that focuses on doing awesome work for clients while surrounded by an awesome team? If so, keep reading…..Job description: Test and Measurement EngineerAbout UsBravo Team LLC is an ISO 9001:2015 certified engineering design and fabrication company based in Mooresville, NC. We help businesses, engineers, and inventors bring their ideas to life through innovative engineering design, prototyping, machining, and fabrication capabilities. We develop a wide variety of prototype and proof of concept machines and products.Bravo Team takes pride in helping customers solve problems and achieve their goals quickly and cost-effectively, whether a customer-supplied build-to-print drawing or a custom design.At our core, we are a special force engineering team that completes challenging technical work on time and on budget. We use our collective skill and talent to create novel solutions and products. Along these lines, we:Get better by completing challenging projects that cause us to growGuarantee value to our customersInvest in our futureDon’t back downDo what it takes to guarantee our futureOur office is in the historic Merino Mill in downtown Mooresville. This 8300 sq. ft. facility houses a well-lit office area and adjoining shop. Our office includes CAD workstations, an electronics lab, a break room, and meeting rooms. Our fabrication shop is filled with natural light and well equipped with CNC mills, a CNC lathe, saws, a laser cutter, welding capabilities, and a PCB pick and place assembly line. As such, our engineers are empowered to go directly from a conceptualized design to working in collaboration with our full-time machinists to develop prototypes in house. This ability to quickly iterate design ideas and converge on a viable solution is further enhanced by our farm of FDM and SLA 3D printers.We place high value on team culture, team dynamics, and professional development. Social events, team building exercises and company-wide learning opportunities are emphasized. We offer competitive salaries, comprehensive benefits, and paid time off. We look for candidates that can bring a fresh perspective to the team, but we will only hire teammates that align with our core values:· Remarkable Integrity· Embrace Growth· Transparent Excellence· Win Together· Own the ExperienceWe are looking for an experienced hands-on Test and Measurement Engineer to support development for our customers and for our own products. The ideal candidate will have a can-do attitude and a desire to learn and grow while fielding a variety of work in the following areas:· Machine Design· Automation & Controls· Build-to-Print/Fabrication· Product DevelopmentJOB RESPONSIBILITIES: TEST AND MEASUREMENT ENGINEERWe are looking for a full-time Test and Measurement Engineer to help us manage the growing demands of the company. The ideal candidate will create, draft, and design product layouts and schemes using customer specifications and recommendations. This individual will test products and adjust where necessary. We are specifically looking for someone who pays attention to detail and who is responsive and willing to help with the following:JOB RESPONSIBILITIES: TEST AND MEASUREMENT ENGINEERSupply application/control system design and development to Programmable Logic Controllers (PLCs)Develop, coordinate, and execute test plans to verify and validate standards, specifications, and requirements associated with equipment developmentResearch, survey and ensure equipment and tools necessary for Engineering work is procured, adequate and available to obtain the desired testing and resultsDesign and develop test solutions and/or test hardware/fixtures and software, to perform design validation/production/manufacturing tests of various R&D hardwareResponsible for presenting, both written and oral, communication of design, test results and project status to all levels within the organizationResearch new equipment, methods and techniques and implement changes to provide cost effective test solutionsPerform failure analysis investigations during new product development and in support of manufacturingPerform other functions that may be assignedQUALIFICATIONSBachelor’s Degree in Engineering or equivalent experienceMS Degree is a plus3+ years of related experienceHands-on development skills in two or more application languages, such as: C, C++, Python, Java, JavaScript, C#, Objective-C, Dart, Swift or equivalent languagesExperience with the design, realization, execution, and analysis of test setups on mechanical and electrical systemsProficient experience with LabVIEWProficient experience with PLC programmingExcellent organization, interpersonal, and leadership skillsStrong commitment to providing superior client satisfactionAbility to work on several projects in parallel in a fast-paced environmentPreferred experience with plan and budget creationSKILLSTo thrive in this job, you’ll need the following skills:Desire to learn and apply new information or skillsRead and interpret data, information, and documentsAbility to complete assignments with attention to detail and high degree of accuracyWork independently or as part of a team and follow through on assignments with minimal supervisionDemonstrate open, clear, concise and professional communicationAbility to establish and maintain cooperative working relationships with manager, co-workers and customerWork according to a strict set of procedures within the provided timelinesFamiliarity with handheld force gages and torque wrenches, digital protractors, digital indicators, gage pins, calipers, height gage, and optical comparatorExperience in operating data acquisition systems using linear positioners, accelerometers, and load cellsAbility to multi-task and prioritize workloadJob Type: Full-timePay: $75,000.00 - $100,000.00 per yearBenefits:401(k)Dental insuranceFlexible scheduleHealth insuranceHealth savings accountLife insurancePaid time offProfessional development assistanceVision insuranceExperience level:2 yearsSchedule:Monday to FridayAbility to commute/relocate:Mooresville, NC 28115: Reliably commute or planning to relocate before starting work (Required)Experience:LabView: 2 years (Required)PLC: 2 years (Required)Work Location: In personShow more  Report",
  "salary": {
    "min": 75000,
    "max": 100000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "Rule One Brands",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "Moreland, GA",
  "jobTitle": "Lead Software Engineer",
  "jobDetails": "Lead Software Engineer VHow would you like to be part of an innovative Scrum team developing financial investment applications – while still having a life? Would you enjoy solving complex problems in a fast-paced, continuous delivery environment – with a 4-day, 36-hour work week? At Rule One you’ll be an important part of a small group of industry disruptors who are out to change the investing world.We are seeking a Lead Software Engineer with a passion for building best in class mobile applications that help the little guy become financially literate. Our ideal candidate for this position will have extensive experience leading development teams for both the iOS and Android environments, as well as building HTML5 and standalone apps. To complete the package, this person will have fully embraced Agile methodologies, being an expert in Scrum, XP, and Kanban.How do you feel about Red, Green, Clean? We do all work in pairs, using a test-driven design and development approach. Our collaborative team environment features the delivery of working software weekly, using an incremental, iterative approach. What languages you know are not as important as your willingness and ability to learn and use the tools that best fit the job at hand. We strive to share our knowledge with each other, becoming a better team each Sprint.Our co-located team works and plays hard on a beautiful horse farm southwest of Atlanta. Our office is in a converted farmhouse with the analysts for two investment funds. We don’t work overtime or weekends, and we get a month of paid vacation.Collaborate directly with the Rule One CEO, Phil Town, as he conveys his vision of creating robust investment tools that bring powerful information globally to millions of people seeking to achieve financial independence. As a benefit, we also offer you access to Rule One Investing educational classes.Unleash the power of Agile software development as you learn from our Scrum Master, Bill Johnson, who incorporates XP, Kanban and Lean practices with Scrum and lists his personal mentors as Jeff Sutherland, creator of Scrum, and Rich Sheridan, author of “Joy, Inc.”Be instrumental in creating a transformative set of investing tools for the individual, amateur investor, using programming languages like Swift, Kotlin, HTML5, Java and JavaScript.Leverage your unique experience and knowledge to architect state of the art development and deployment platforms using a hybrid cloud environment.Basic QualificationsMaster’s degree in computer science or related discipline.8 years of software development experience demonstrating depth of technical understanding within a specific discipline(s)/technology(s) to include 2 years demonstrated leadership driving enterprise technology projects or initiatives.6 years of experience delivering technology solutions in all phases of the software systems and application development lifecycle.Highly proficient in software engineering languages and tools; ability to develop on multiple platforms.3 years of experience in AGILE methodologies (Scrum, XP, Kanban, Lean).Knowledge and advanced experience of Test-Driven Development in pair programming environments.Demonstrated ability to address complex production issues by troubleshooting applications and systems.Ability to quickly understand applicable business acumen to provide appropriate Engineering solutions.Deep Understanding of Swift and Kotlin, and understanding of the following: Java, JavaScript, Objective-C, C++, HTML5, CSS, SQL.Preferred Qualifications:6 years of experience with REST frameworks and integrating backend services like ORM frameworks (Hibernate, JPA, JDO), JDBC.Ability to design and implement container-based APIs using container frameworks like OpenShift, Docker, or Kubernetes.Relational Database design and optimization with Oracle DB2, MySQL, or PostgreSQL.Working experience with CI/CD apps like Gradle, GIT, GitHUB, GITLab around continuous integration and continuous delivery infrastructure.Experience in designing and developing automated tests and frameworks.Job Type: Full-timePay: $160,000.00 - $170,000.00 per yearBenefits:401(k)401(k) matchingHealth insuranceHealth savings accountPaid time offSupplemental pay types:Bonus payAbility to commute/relocate:Moreland, GA 30259: Reliably commute or planning to relocate before starting work (Required)Education:Master's (Required)Experience:Software development: 8 years (Required)Agile: 3 years (Required)Test-driven development: 3 years (Required)Mobile applications: 4 years (Required)Work Location: In personShow more  Report",
  "salary": {
    "min": 160000,
    "max": 170000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
},
{
  "companyDetails": {
    "logo": null,
    "name": "Gas Pos",
    "ceoName": null,
    "headquarters": null,
    "industry": null,
    "sector": null,
    "companyRating": null,
    "careerOpportunitiesRating": null,
    "compensationAndBenefitsRating": null,
    "cultureAndValuesRating": null,
    "workLifeBalanceRating": null,
    "revenue": null,
    "size": null,
    "type": null,
    "website": null,
    "yearFounded": null
  },
  "jobLocation": "North Little Rock, AR",
  "jobTitle": "Full Stack .Net Developer",
  "jobDetails": "Job SummaryGas Pos is disrupting the way fuel is sold in America. In partnership with some of the largest Logistics and Truck Stops organizations in the world we have launched a new mobile first payment system for Fleets and the general public.Our organization is looking for someone who is:Passionate about distributed systems and building high scale servicesLikes to work in an agile development team that iterates rapidlyLoves new technological challenges and excels at solving themExcited about making better software and continuously improving the development, integration, and deployment process Software engineers in our team wear many hats and demonstrate technical breadth, depth, and leadership.You will participate in all stages of the engineering lifecycle. As an engineer in the team, you will provide hands-on, technical leadership in your assigned domain.Basic Qualifications:BS in Computer Science or 4 years of IT work experience4+ years of experience with one or more general purpose programming languages including but not limited to: Java, C/C++, C#, JavaScript2+ years design and implementation of web services development experience1+ years of experience implementing and/or operating large scale software services, components, or feature areasDemonstrated proficiency in coding, code reviews, and technical communicationPreferred Qualifications:Knowledge of Microsoft Azure•Effective collaborator, experienced in creating technical partnerships across teamsJob Type: Full-timePay: $120,000.00 - $150,000.00 per yearExperience:Engineering: 4 years (Required)Location:North Little Rock, AR (Preferred)License:MCSE (Preferred)Show more  Report",
  "salary": {
    "min": 120000,
    "max": 150000,
    "payPeriod": "ANNUAL",
    "currency": "USD",
    "source": "EMPLOYER_PROVIDED"
  }
}]