[{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Cardinale Group4.6 ★Automotive Digital Marketing ManagerSan Jose, CA$61K - $93K (Glassdoor est.)Easy ApplyBachelor's Degree in Marketing/Advertising, Business, Computer Science, Engineering or related field. The Digital Marketing Manager will support the Cardinale……30d+",
  "jobDetails": "Automotive Digital Marketing Manager\nJob Description:\nCardinale Automotive Group is looking for an experienced and passionate Digital Marketing Manager to join our family. The Digital Marketing Manager will support the Cardinale Automotive Group (CAG) Marketing team in the ideation, execution, and measurement of digital marketing strategies and campaigns aimed at driving traffic to CAG dealerships. This on-site position is located at our Corporate office in Marina, CA. Relocation allowance is available for the right candidate.\nAbout Us:\nCardinale Automotive Group is a world-class organization of happy employees. Relationships are the foundation of our success. With every vehicle sold, every automobile serviced, every customer interaction and every new hire brought onboard – we strive to create outstanding and long-lasting relationships. This means listening, caring, and understanding. After forty years of success, we're proud to call ourselves one of the nation's top-performing dealer groups.\nCHECK US OUT HERE: https://www.youtube.com/watch?v=gxgPsUqYkUg\nResponsibilities:\nProvide Digital Marketing strategic direction for Cardinale Automotive Group dealerships.\nCollaborate with other CAG Digital Marketing leaders in various functional areas: Paid Digital Advertising (PPC, Display, Social and Video Advertising, etc…), SEO/Content Development, Website Maintenance, Inventory Syndication, Email Marketing / E Newsletters.\nDevelop full understanding of marketing challenges and competitive landscapes for all CAG dealerships and markets.\nAs one of the resident Digital Marketing experts, provide training/coaching/guidance to CAG Digital Marketing staff and Advertising Consultants.\nStay abreast of and implement latest Digital Marketing trends in order to continuously drive qualified traffic to CAG websites and dealerships.\nMeasure and report performance of all Digital Marketing campaigns, and assess results against goals and benchmarks.\nManage monthly enterprise Digital Marketing reporting process\nAs necessary, provide in-dealership Digital Marketing consultation to CAG General Managers/Partners.\nOversee monthly Digital Marketing Review process, which include a full analysis of dealership performance in the following areas: website performance and user experience, paid digital and SEO.\nManage Digital Marketing communication with key stakeholders: senior dealership staff, internal key department heads and media partners.\nManage key Digital Marketing vendor relationships, which include but are not limited to Google, Microsoft, Yahoo, Facebook, SearchForce, Dealer.com, CDK, AutoTrader, Cars.com, TrueCar, CarGurus, etc…\nQualifications:\nAutomotive background required\nBachelor's Degree in Marketing/Advertising, Business, Computer Science, Engineering or related field\nMinimum 2 Years Management Experience\nMinimum 5 Years Digital Marketing Experience\nKnowledge & Skills:\nTier 3 automotive marketing experience preferred\nWorking knowledge of website analytics tools such as Google Analytics and Webmaster Tools\nExperience with A/B and multivariate experiments\nWorking knowledge of HTML, CSS, and JavaScript development and constraints\nWorking knowledge of email and video marketing tools, processes and best practices\nWorking knowledge of vehicle inventory syndication tools (vAuto, HomeNet, etc…) and processes\nWorking knowledge of automotive CRM platforms, a plus\nWorking knowledge of Online Reputation Management platforms and best practices\nStrong presentation skills\nGoogle Analytics certification\nGoogle AdWords certification\nWhat We Offer:\nCompetitive compensation\nFast paced work environment\nHealth, Dental, and Vision offered after 90 days\nEach year we look to provide the very best insurance we can offer.\n401k provided by Empower\nAncillary insurance provided by Allstate\nFSA offered.\nLife Insurance provided for and paid by Cardinale Automotive Group.\nWe are an equal opportunity employer and prohibit discrimination/harassment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n#ZRShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Santa Clara, CA",
  "jobTitle": "Oscar Mike3.6 ★IT Digital Solutions Tech LeadSanta Clara, CA$170K - $195K (Glassdoor est.)Easy ApplyIn this position you will perform functional reviews, technical design review, and oversee projects implementation from start to finish.…30d+",
  "jobDetails": "Direct-Hire (visa sponsorship is being offered for this position)Location: Santa Clara, CAOur client, a leader in life sciences, diagnostics and applied chemical markets, is seeking a highly motivated IT Digital Solutions Technical Lead to help build their next-generation content management solution and online user experience.This includes implementing and integrating CMS (e.g. AEM) solutions and providing guidance and collaborating with the technical team while working closely with other IT, suppliers, and business partners.This lead role drives technical decisions, reviews, and is accountable for the overall solutions while ensuring the solutions meet IT architectural best practice, performance, compliance, security, and business requirements.In this position you will perform functional reviews, technical design review, and oversee projects implementation from start to finish.Technical knowledge includes enterprise web content management systems with integration to external content sources, cloud-based applications, and development toolsets.You will work closely with IT project managers, architects, suppliers, and business partners to ensure any proposed solutions follow industry best practices.Key accountabilities include: Provide technical leadership in the delivery of projects small to large sizeLead and provide technical oversight for customer facing portal & supporting online applicationsDrive solution design decisions and development estimatesWork closely with Architects, Product Owners and Business Partners to create applications aligned with business strategy.Drive and address any critical development to production issues which have been escalated to the project team.Drive and perform products/new technologies/solutions proof of concept and new product evaluationProduce project documentation, including functional and technical designs, and KT guides.Manage vendors’ resources and lead key technical decisionsAbility to lead and facilitate effective meetings, and presentations.Excellent interpersonal skills (both written and verbal) and strong leadership qualitiesQualifications:Bachelor’s Degree in Computer Science, or equivalent plus minimum 8 years of relevant experience, including minimum 8 years in IT5+ years of hands-on experience with Adobe Experience ManagerExperience with popular CMS (e.g. AEM) integrating with these types of systems: (Product information management systems (PIMs), Translation Management System, Single Sign-On via OIDC, eCommerce Platform, Search/Insight Engine, Analytics Engines, Content Delivery Networks for optimal performance to Worldwide customers, Integration Platform As A Service (iPaaS))Familiarity with different types of databases and AWS Products and when to use themStrong experience in using Adobe Experience Manager as a CMS for customer facing websitesStrong understanding of common Adobe integration patterns, and general design and architecture patternsGeneral knowledge related to performance, reliability, scalability, security, and disaster recovery of enterprise applicationsExpertise in core web technologies including REST, JSON, XML, HTML5, CSS, client/server-side-scripting languages such as NodeJS, JavaScript preferably using SPA (Single page application) and web services development using RESTful implementations.Experience with customer facing applications and performance measures.Must be familiar with DevOps and industry best practicesExperience with Agile SCRUM development methodologyAbility to translate requirements into detailed design and solution documentDemonstrated ability to troubleshoot complex issues in development and productionExcellent interpersonal, communication and team-facilitation skillsStrong attention to detail and deadlinesAbility to work well under pressure and work on multiple projects concurrentlyAbility to work well with global team members/suppliersAbility to work independently with minimal supervisionJob Type: Full-timePay: $170,000.00 - $195,000.00 per yearSchedule:8 hour shiftAbility to commute/relocate:Santa Clara, CA: Reliably commute or planning to relocate before starting work (Required)Work Location: In personShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Pleasanton, CA",
  "jobTitle": "Vagaro3.4 ★Cyber Security Engineer - OnsitePleasanton, CA$135K - $175K (Glassdoor est.)Easy ApplyProfessional certification such as CEH and OSCP is a plus. Collaborate with engineering to implement secure designs and coding training.…28d",
  "jobDetails": "Vagaro is seeking a motivated security engineer who brings strong security knowledge, skill set, and passion in securing modern cloud applications and infrastructures. In this role, we expect the candidate to make impactful contributions to every aspect of Vagaro's operations – security is baked in the operations, a value proposition, and a differentiation offer to our customers.Your career at Vagaro is unbounded – we invest in people. You demonstrate what you can do, and we will help you get there. This role is a great opportunity to be part of a unicorn company and a career breakthrough in cybersecurity professional, leadership, and/or cloud expert.\\*\\*\\*This is an on-site position located in Pleasanton, CA\\*\\*\\*Perks:15 days PTO9 company holidaysReimbursement program using any of Vagaro services.401k retirement plan with matchingHealthcare, dental & vision plans for individuals and familiesLife insurance, supplemental programsTuition reimbursement programDiscounted tickets programDoordash Dash PassOn-site fitness centerWork/Life & EAP servicesResponsibilities:Design, implement, and support security tooling across cloud and on-prem infrastructures.Conduct vulnerability scans, perform attack simulations and coordinate pen-tests.Perform security and risk assessments, threat modeling, and remediation assistance.Lead incident investigation and root cause analysis.Guide security operations, including email, endpoint, network, and system hardening.Collaborate with engineering to implement secure designs and coding training.Assess threat intelligence and provide security briefing to internal stakeholders.Qualifications:Any of the followingB.S. in Computer Science, Information Science, or Engineering with 2+ years in cybersecurity positions3+ years of work experience in web development plus coursework from cybersecurity bootcamp or degree program4+ years of work experience as a cybersecurity practitionerSolid understanding of network protocols, web application technology, security monitoring toolsProgramming skills from prior work experience in at least one of C# (web applications), C/C++ (IoT), PowerShell or Linux shell programming (system maintenance), JavaScript (web frontend or backend), Python (data processing), SQL or DB Query (data correlation)Experience in security tools - Burp Suite, Tenable Nessus, Zap, Wireshark, SIEM, Kali Linux, CSPM, CWP, etc.Experience in implementing anomaly detection, infrastructure monitoring, attack mitigations, and threat modelingExperience in securing infrastructure and applications in Azure, AWS or GCPProfessional certification such as CEH and OSCP is a plus.About the Company:Vagaro, Inc. develops all-in-one business management platforms and powerful online marketplaces for the salon, spa, and fitness industries. More than 174,000 professionals and 67000 businesses in the United States, Canada, the United Kingdom, and Australia use Vagaro's cloud-based software to manage all aspects of their operations and to market their services to local customers. Consumers choose Vagaro to search for and book services in their community at their convenience. Vagaro is easy-to-use and works on any device. Learn more by visiting https://www.agaro.com and https://sales.vagaro.com.Job Type: Full-timePay: $135,000.00 - $175,000.00 per yearShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "VerientJunior DeveloperSan Jose, CA$83K - $121K (Glassdoor est.)Easy ApplyDemonstrates basic knowledge of object and component methodology and technology. Understands basic relational database concepts.…30d+",
  "jobDetails": "Junior Developer\nSkills:\nDemonstrates basic knowledge of object and component methodology and technology.\nRecognizes the fundamental differences between the various internet browsers.\nHands on experience with at least one of the industry wide used framework\nExhibits proficiency in HTML, Javascript, CSS\nPossesses basic knowledge of XML/XSL, AJAX.\nUnderstands basic Web Technologies like Struts, MVC, JSP, Servlet, Tag library, JQuery\nUnderstands basic relational database concepts.\nConfidently writes the four basic SQL statements.\nPossesses knowledge of various database access methods.\nUnderstands SDLC\nApplyShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Motion Recruitment3.4 ★Senior Front end 4+San Jose, CA$130K - $175K (Glassdoor est.)You are a frontend engineer who has had in-depth experience with React or similar frameworks. You have programmed for long enough to not need a lot of guidance,……24h",
  "jobDetails": "My Client is looking for someone within the 4-6 year mark, must be interested in startups and willing to stay at a startup!\n\nAbout you\nYou are a frontend engineer who has had in-depth experience with React or similar frameworks.\nYou have programmed for long enough to not need a lot of guidance, and know how to seek the right resources for solving open-ended problems.\nYou are action-oriented, and are excited to ship features and iterate with customers.\nYou are excited to build for developers, and are ready to do what it takes to make them successful, even if it involves non-coding tasks like documentation, or hopping on a video call to help them troubleshoot.\nMust Haves\n4+ years of experience in React Typescript and JavaScript\nSome back end experience is nice to have like Java or Python\nAll of these must be professional experience and shown on your resume that you worked full time using them\nMust be local to the Bay Area the final involves an on-site and candidates must be able to in\nMust have a degree of some sort or boot camp experience but can not be a new grad professional experience is important and internships don't count\nWe can not provide sponsorship right now for this positionShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Hewlett Packard Enterprise4.2 ★Software Engineering GraduateSan Jose, CA$65K - $151K (Glassdoor est.)Position requires a Bachelor's/Master's degree with a focus in computer science, computer engineering, software development or other IT related field prior to……30d+",
  "jobDetails": "Software Engineering Graduate\nThis role has been designated as ‘Edge’, which means you will primarily work outside of an HPE office.\nJob Description:\nAdvance the way you live and work at HPE.\nWho We Are:\nAt HPE, our team members search beyond customers' needs today to accelerate what’s next and make a difference — for others, our company, and the planet. Our customers turn to us because we are positive, empathetic, and enterprising. We embrace opportunities to accelerate this transformation across data, connectivity, cloud, and security. And together we make what was once thought impossible, possible.\nThat’s why we not only give you the space to grow into the professional you want to be, but we also embrace who you are and where you come from. We also value the flexibility and autonomy to balance work and personal needs in a way that works best for you.\nA career as a Software Engineer Grad allows you the opportunity to gain exposure and growth expertise on a wide palette of cutting-edge technologies while being involved in delivering business-critical projects.\nWhat you'll do:\nYou will design, develop, troubleshoot and debugs software programs for software enhancements and new products. You will develop software including operating systems, compilers, routers, networks, utilities, databases, and Internet-related tools. You will determine hardware compatibility and/or influence hardware design.\nYou will gain exposure and growth expertise on a wide palette of cutting-edge technologies while being involved in delivering business-critical projects. You will work closely with our QA, DevOps, Software Development engineers and architects.\nThe technology:\nProgramming languages like C, C++, python, Javascript, Java or others\nSQL/ NoSQL DBs, GNU, Linux, IPC and process scheduling; networking protocols TCP/IP\nFull-stack Java software development, Java frameworks and application servers, Web Services (SOAP/REST API), responsive JS (Angular/Node/React.js), version control (preferably Git)\nLocations:\nRoseville, CA\nSan Jose, CA\nFort Collins, CO\nAlpharetta, GA\nAndover, MA\nBloomington, MN\nRaleigh-Durham, NC\nNashua, NH\nHouston, TX\nWhat you’ll need:\nPosition requires a Bachelor's/Master's degree with a focus in computer science, computer engineering, software development or other IT related field prior to your start date\nKnowledge of at least one programming language like C, C++, python, Javascript, Java or associated libraries, web-sockets, and other cloud networking protocols\nA familiarity with and understanding of design for software systems running on multiple platform types\nA basic understanding of Object-Oriented Programming (OOP) principles & Model View Controller (MVC) design patterns, in addition to, SQL/ NoSQL DBs, GNU, Linux, IPC and process scheduling; and networking protocols TCP/IP\nExposure to full-stack Java software development, Java frameworks and application servers, Web Services (SOAP/REST API), responsive JS (Angular/Node/React.js), version control (preferably Git); exposure or use of modern technologies and tools such as Maven/Gradle, Ansible, SonarQube, Kubernetes/Docker/VirtualBox/Vagrant, Nexus, JIRA is a plus\nWhat we’d prefer you bring:\nA GPA of 3.0 or higher\nThe drive to seek out what’s next and to deliver exceptional results\nA collaborative, solution focused spirit and overall sense of urgency\nThe desire to embrace new ideas and fresh thinking and seek out ideas different than your own\nExperience as an active leader on campus who strives to make a positive impact on the world\nComfort with working in a hybrid (virtual and face-to-face) environment\nExceptional communication and presentation skills and the ability to ask smart questions\nAt HPE, we’re:\nRanked 19th on Fortune’s 2022 list of 100 Best Companies to Work For\nRanked 7th on Newsweek’s list of America’s Most Responsible Companies 2022\nNamed a Best Place to Work for Disability Inclusion for the sixth year in row\nNamed one of the 100 Best Large Workplaces for Millennials in 2021\nRecognized as one of the Best Companies for Multicultural Women by Seramount\nReady to take the next step? Open up opportunities with HPE.\nHPE is an equal opportunity employer/Female/Minority/Individual with Disabilities/Protected Veteran Status\n#graduates\nJob:\nEngineering\nJob Level:\nEntry\nStates with Pay Range Requirement\nThe expected salary/wage range for a U.S.-based hire filling this position is provided below. Actual offer may vary from this range based upon geographic location, work experience, education/training, and/or skill level. If this is a sales role, then the listed salary range reflects combined base salary and target-level sales compensation pay. If this is a non-sales role, then the listed salary range reflects base salary only. Variable incentives may also be offered. Information about employee benefits offered can be found at https://myhperewards.com/main/new-hire-enrollment.html.\nAnnual Salary: $65,400.00 - $150,600.00\nHewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities.\nHPE will comply with all applicable laws related to employer use of arrest and conviction records, including laws requiring employers to consider for employment qualified applicants with criminal histories.Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "Santa Clara, CA",
  "jobTitle": "UST3.9 ★React JS DeveloperSanta Clara, CA$97K - $134K (Glassdoor est.)Proficiency in HTML, JavaScript, CSS with Es6 concepts. We are looking for someone who have experience in Redux with any middleware’s like redux-thunk.…30d+",
  "jobDetails": "React JS Developer\nWho we are:\nBorn digital, UST transforms lives through the power of technology. We walk alongside our clients and partners, embedding innovation and agility into everything they do. We help them create transformative experiences and human-centered solutions for a better world.\nUST is a mission-driven group of over 29,000+ practical problem solvers and creative thinkers in over 30+ countries. Our entrepreneurial teams are empowered to innovate, act nimbly, and create a lasting and sustainable impact for our clients, their customers, and the communities in which we live.\nWith us, you’ll create a boundless impact that transforms your career—and the lives of people across the world.\nVisit us at UST.com .\nYou Are:\nWe are looking for someone who have experience in Redux with any middleware’s like redux-thunk.\nWhat you need :\nSkills and Experience:\nProficiency in HTML, JavaScript, CSS with Es6 concepts\nExperience in React with latest versions, using hooks\nExperience in Redux with any middleware’s like redux-thunk\nGood to have experience in SASS/LESS and typescript\nExperience in building dynamic charts and interactions with D3.js\nCompensation can differ depending on factors including but not limited to the specific office location, role, skill set, education, and level of experience. As required by local law, UST provides a reasonable range of compensation for roles that may be hired in California, Colorado, New York City or Washington as set forth below.\nRole Location: Range of Starting Pay for Role\nCalifornia: $63,000 - $95,000\nWhat we believe :\nWe’re proud to embrace the same values that have shaped UST since the beginning. Since day one, we’ve been building enduring relationships and a culture of integrity. And today, it's those same values that are inspiring us to encourage innovation from everyone, to champion diversity and inclusion, and to place people at the center of everything we do.\nHumility:\nWe will listen, learn, be empathetic and help selflessly in our interactions with everyone.\nHumanity:\nThrough business, we will better the lives of those less fortunate than ourselves.\nIntegrity:\nWe honor our commitments and act with responsibility in all our relationships.\nEqual Employment Opportunity Statement\nUST is an Equal Opportunity Employer.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nUST reserves the right to periodically redefine your roles and responsibilities based on the requirements of the organization and/or your performance.Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "Fremont, CA",
  "jobTitle": "E&E Co., Ltd.3.0 ★Research and Data AnalystFremont, CA$32.00 Per Hour(Glassdoor est.)Easy ApplyCollaborate with our sales, merchants, and stakeholders to design new analytics approaches supporting evolutions with new needs and initiatives.…30d",
  "jobDetails": "RESPONSIBILITIES:· Execute daily ROI report of our e-commerce business on client websites including Macys.com, Kohls.com, WayFair.com, and JCpenney.com with compiling data and graphic charts· Find business opportunities through ROI report and propose strategies with specific KPIs that can drive company e-commerce sales with presentable PPT· Oversee campaign schedules and ensure each campaign’s images, copies, and user experience are in quality. Track daily ad spending and real time ROIs to generate profitable sale· Detect issues and report to supervisors in time. Coordinate with marketing teams to fix content related issues. (It’s helpful if the candidate can use Photoshop or web coding to fix the issue)· Collaborate with our sales, merchants, and stakeholders to design new analytics approaches supporting evolutions with new needs and initiatives· Maintain a deep understanding of our products and core business definitions. Contribute to suggesting top opportunities and open new markets for business growthREQUIREMENTS:· 2 years working experience in data analysis· Proficiency in Excel formulas including pivot table, vlookup, and if statements· Strong analysis and summary skills to discover problems and business opportunities· Good at finding data resources with Googling and through existing materials· Great communication skills to discover insights during the conversation with co-workers· Ability to listen, pay attention, and learn knowledge quickly from seniors· Multi-task management skills to organize priorities and ensure deadlines· Experience in social media posting is a plus· Proficiency in Adobe Photoshop and Illustrator is a plus· Understanding of web development including HTML, CSS, and JavaScript is a plus· Advertisement bidding experience is a plusJob Type: Full-timePay: From $32.00 per hourBenefits:401(k)401(k) matchingDental insuranceFlexible spending accountHealth insuranceLife insurancePaid time offVision insuranceExperience level:2 yearsSchedule:8 hour shiftMonday to FridayAbility to commute/relocate:Fremont, CA 94538: Reliably commute or planning to relocate before starting work (Required)Experience:Data analysis skills: 2 years (Preferred)E-commerce: 1 year (Preferred)Work Location: In personShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Mountain View, CA",
  "jobTitle": "Locus Technologies3.5 ★Entry Level Product EngineerMountain View, CA$77K - $110K (Glassdoor est.)Able to collaborate and communicate effectively across multiple technical teams. Must be able to collaborate with all of our engineering teams to quickly……30d+",
  "jobDetails": "Position Details\nWe’re building the world’s most advanced Environmental Health and Safety System. The Engineering Team is growing and seeking a Software Engineer who will work as a support analyst and have expertise in the areas of SaaS, Databases, User Interface (UI), Mobile Technologies and Authentication. Must have a technical understanding of software and is capable of taking a holistic view of complex systems. Must be able to collaborate with all of our engineering teams to quickly analyze and diagnose issues for product improvement.\nResponsibilities\nDevelop product expertise in various Locus products and the Locus code stack\nTrack and manage customer reported issues via a case management system\nParticipate in product defect/enhancement process by assisting with requirements, implementing code changes, designing test cases, and creating documentation\nFollow agile methodology for delivering software\nCollaborate with multiple teams throughout the product life cycle, including Development, Product Management, Program Management, Testing, and DevOps\nRequirements\nWorking knowledge of Java, JavaScript, JSON, HTTP, SQL\nFamiliarity with Mobile software such as iOS\nGood understanding of all browsers and use of developer tools\nKnowledge of code management systems such as GIT or SVN\nExcellent problem solving, analytical and troubleshooting skills\nAbility to absorb new technology and features\nCapable of excelling in a fast-paced environment\nAble to collaborate and communicate effectively across multiple technical teams\n\nSALARY RANGE:\n$30,000 to $500,000\nExperience\n0-2 Years\nEducation\nBachelor's Degree in Math/Science/Engineering/Computer ScienceShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Sun-Net Inc.4.1 ★Software QA Engineer (Manual Tester)San Jose, CA$79K - $119K (Glassdoor est.)Easy ApplyQA software tools (Zephr Scale). Understanding Product functionality and user requirements. Our enterprise product is built using HTML5, CSS3, Javascript……30d+",
  "jobDetails": "Sun-Net Inc. provides software solutions to the electric utility industry. Our enterprise product is built using HTML5, CSS3, Javascript frontend with J2EE backend using Oracle and SQL Server database.\nWe are offering full-time/contract position for a Manual Tester. Job responsibilities will include:Understanding Product functionality and user requirements.Writing test plans, test cases and preparing test dataManual testing of product functionality across multiple projects and releases.Identify issues and work with the team members to figure out solutionsDefect managementProvide daily reports to Project Leads regarding testing status.\nPlease join us if you are interested in QA involving real project work with a growing company.\nSkills that will be needed to make you successful:\nTechnical SkillsUnderstand QA process and life cycle including E2E and UATJIRA management softwareSQL knowledgeQA software tools (Zephr Scale)Effective test case writingDefect creation and validation\nPeople SkillsAbility to organize and work independently.Take initiative in researching and understanding new/unknown conceptsDocument test approaches and results.Communicate and Coordinate with various team members frequently and relentlessly to achieve test objectives\nCOVID-19 precautionsRemote interview processVirtual meetingsSanitizing, disinfecting, or cleaning procedures in place\nApplicant Qualifications\nYou have requested that Indeed ask candidates the following questions:\nWhat is the highest level of education you have completed?\nHow many years of manual test experience do you have?\nPlease list 2-3 dates and time ranges that you could do an interview.Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "Sunnyvale, CA",
  "jobTitle": "AVS Solutions INCFull Stack DeveloperSunnyvale, CA$50.00 - $55.00 Per Hour(Glassdoor est.)Easy ApplyYou create and improve systems, bridging the gap between the user and backend developers to provide the best user experience.*.…25d",
  "jobDetails": "Full Stack Developer - React, Node JSSunnyvale, CAYou create and improve systems, bridging the gap between the user and backend developers to provide the best user experience.Tech Skills: JavaScript (React, Redux, Ember JS or Angular 1.x/2x), CSS3, HTML5, Restful API's, Node.JS, Scala, Ruby on Rails, Python or Java.Job Type: ContractSalary: $50.00 - $55.00 per hourSchedule:8 hour shiftAbility to commute/relocate:Sunnyvale, CA 94085: Reliably commute or planning to relocate before starting work (Required)Experience:Java (Preferred)REST (Preferred)Work Location: One locationShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Santa Clara, CA",
  "jobTitle": "HyadestechincFront End DeveloperSanta Clara, CAEasy ApplyBachelor's degree in Computer Science,Software Engineering, Information Technology, Computer Engineering or a related field of study required.…30d+",
  "jobDetails": "Design and development of software application covering Conceptual Modeling, Object Oriented Conceptual Modeling, Process Modeling, Behavior Oriented Conceptual Modeling, Method Engineering.\nResponsible for developing Multi-platform Software Application and developing plug-in architecture using Model-view-Controller and Factory, Singleton Design pattern using React.js, Node.js, Angular.js MVC and Spring framework.\nDesign and develop high performance software application using prototypical, pseudo-classical patterns, or JavaScript data structures and standard practice.\nImplement and Migrate MVC model and JavaScript MVC model.\nUnderstand Simple customization of the framework and modify the architecture of the user interface.\nAdd and modify a custom framework and Architect sophisticated multi-threaded apps using JavaScript MVC and Backbone.js framework with REST API and Java framework.\nResponsible for Advanced element targeting using backbone API and Libraries. Add and Customize User Interface component using CSS and HTML5.\nJob Requirements:\nBachelor's degree in Computer Science,Software Engineering, Information Technology, Computer Engineering or a related field of study required.\nMinimum 2-3 years related experience.\nDetail orientated with excellent time management skills.\nExcellent written and verbal communication skills.\nExperience/Knowledge of Agile methodology and application design.\nStrong knowledge of HTML, CSS, JSON, MySQL, and JavaScript MVC, are required.\nIF INTERESTED PLEASE EMAIL YOUR RESUME TO jobs@hyadestechinc.com.Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Surya Systems3.9 ★Front End DeveloperSan Jose, CA$80.00 Per Hour(Glassdoor est.)Experience architecting Front End on large scale applications with responsive and reactive design. Engage with researchers, engineers, user experience designers……30d+",
  "jobDetails": "Position : Front End Developer\nLocation: San Jose, CA\nDuration : 6+ Monts C2H\nRemote\nJD:\n7+ years of web development experience\n\nExtensive experience with React/Angular JavaScript framework\n\nSolid experience with Typescript and applying Object Oriented Design Patterns\n\nExperience with HTML5, CSS3, REST, and Web Sockets\n\nExperience architecting Front End on large scale applications with responsive and reactive design\n\nExperience writing component library & creating style components\n\nExperience architecting Front End on large scale applications\n\nExperience with optimizing applications including JavaScript profiling, memory usage, and page speed optimization.\n\nEngage with researchers, engineers, user experience designers and product managers to prototype new ideas, new technologies, and help to create innovative solutions.\n\nProvide leadership and mentor team members on modern software principles\nThanks & Regards ...\nG Naveen Kumar\nEmail : GavvalaN@suryasys.com\nDesk : 215-344-2345\nSurya Systems, Inc\n120 E Uwchlan Avenue Suite 203\nExton, PA 19341\nWWW.SURYASYS.COMShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Newark, CA",
  "jobTitle": "Lead5 Media4.0 ★front end HTML developerNewark, CA$66K - $98K (Glassdoor est.)Easy ApplyBachelor's degree in business or relevant field preferred. Ability to work with Adobe photoshop and be well versed with graphic design concepts.…30d+",
  "jobDetails": "responsibilities:\nDevelop and maintain clients' websites and perform standard updates on the site\nWork with the inhouse backend platform and figure out ways to integrate all websites with the backend\nCreate and deploy new websites out of new concepts and designs\nEnsure that all elements, templates, and finished solutions work with a variety of browser types and screen-settings along\n\nwith the constraints set by development and design\nParticipate in efforts to improve quality of websites and other electronic publications as required\nqualifications and experience:\nMinimum of 2+ years of experience in a similar position\nSkilled in Web 2.0 technologies like Html, DHTML, CSS, Javascript & JSP technologies\nAbility to work with Adobe photoshop and be well versed with graphic design concepts\nNeeds to be hands on with frameworks like Ajax, JQuery, Yahoo UI, Google Maps, Google Adsense, Google Analytics etc.\nKnowledge about browser compatibility issues across browsers and versions\nSelf motivated, excellent organizational skills and ability to work independently as well as team member\nBasic Database and SQL knowledge is preferred\nBachelor's degree in business or relevant field preferred.Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "Milpitas, CA",
  "jobTitle": "TomCloudSoftware Developer (Front-End/Web)Milpitas, CA$65K - $85K (Glassdoor est.)Easy ApplyIn fields of healthcare, banking, and financial services, high-tech IT business, retail and e-commerce, insurance, entertainment, telecom and cable, pharmacy……25d",
  "jobDetails": "Software Developer - Web/UIAbout TomCare:TomCare (TCR) is a technology-driven multi-line managed care enterprise and is one of the leading providers of Enterprise software solutions, comprehensive IT solutions, including Systems Integration, Consulting, Information Systems outsourcing, IT-enabled services, telecommunication, R&D etc. We specialize in placement of UI Developers, ReactJS, AngularJS, Quality Assurance Analyst, Data Analyst, Software Developers, UX Engineers etc. in fields of healthcare, banking, and financial services, high-tech IT business, retail and e-commerce, insurance, entertainment, telecom and cable, pharmacy and life science, oil and gas, travel and transportation, and local and state government for both permanent and contract C2C staffing arrangements. Our recent placements include Molina, Cigna, Aetna, CVS, Walgreens, Walmart, Apple, Google, Facebook, JPMC, Wells Fargo and several other fortune 500 companies.Website: https://tcr.ai/H1B Info: https://h1bdata.com/pin/tomcare/Knowledge and Skills:Experienced with several technologies such as: React JS, SASS, JSON, AJAX and BootstrapProvided solid markup skills in utilizing HTML5, CSS3, JavaScript, and jQueryDeveloped front-end skills and some basic understanding of how back-end development worksKnowledge of designing mark up, developing the UI of websites and/or web applicationsDemonstrated understanding of UX and UI design with an emphasis on maximizing usabilityKnowledge of using REST web services and working with interface designDesired to work in a collaborative, innovative, flexible and agile JavaScriptDevelopment team-oriented environmentFluent in Mandarin (Mainland)Education and Qualities:Bachelor's/ Master’s degree in Computer Science or related fieldStrong written and oral communication skills in both English and Mandarin preferredDetail oriented, ability to multitask with strong prioritization, planning and organization skillsWilling to relocate and familiar with CCC business frameworkBenefits:Lucrative Annual Base SalaryFull Health Insurance CoverageImmediate H1B, STEM Ext. or GC SponsorshipAccess to exclusive training & mentorship by Senior Google, Microsoft, and Apple engineersHelpful Info:Training Location: Milpitas, CA (at the heart of Silicon Valley)Starting Salary: $60,000.00Placement: Anywhere in US (Must be willing to relocate)Visa sponsorship is available for qualified employeesNo experience required but better to haveMUST be Onsite for Marketing after TrainingJob Types: Full-time, PermanentPay: $65,000.00 - $85,000.00 per yearBenefits:Dental insuranceHealth insurancePaid time offReferral programRelocation assistanceVision insuranceCompensation package:Semiannual bonusYearly payExperience level:1 year2 yearsNo experience neededUnder 1 yearSchedule:8 hour shiftDay shiftMonday to FridayOn callWeekend availabilityExperience:JavaScript: 1 year (Preferred)Language:Mandarin (Required)Work Location: In personShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Speech2Text3.9 ★Software EngineerSan Jose, CA$102K - $152K (Glassdoor est.)Easy ApplyDesign and develop component based applications including user interface, middleware and backend database operations.…30d+",
  "jobDetails": "Developing multitiered distributed web applications for high volume data-intensive healthcare software services\nDesign and develop component based applications including user interface, middleware and backend database operations\nDevelop module specifications in consultation with product marketing team and customers; develop spec documents\nEstimate engineering effort, set and achieve important project development, testing and integration milestones\nWork with other engineering members across geographic locations (San Jose, CA and Bangalore, India) in coding, testing and documentation tasks to achieve milestones on time and within budget\nDevelop technical expertise in new technologies and frameworks such as AJAX, Spring framework and recommend appropriate framework for new product development.\nUtilize Java, XML, XHTML, HTML, Javascript, AJAX technologies to implement applications\nParticipate in design, coding and documentation reviews.\nCandidates need to have at least a BS in Computer Science or Computer Engineering or equivalent degree as well as demostrate good problem solving skills. If you are interested in applying, we would love to hear from you at careers@speech2txt.com.Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "Alviso, CA",
  "jobTitle": "Jobot4.6 ★Senior Software EngineerAlviso, CA$90K - $155K (Glassdoor est.)Bachelors Degree in Computer Science or relevant field. Familiar with event-driven programming in Python. 5+ years working with Java and/or Python Flask.…7d",
  "jobDetails": "An Enterprise AI platform company based in the e-commerce space is looking to add a Senior Software Engineer to their growing team!\n\nThis Jobot Job is hosted by: Kyle Murrow\nAre you a fit? Easy Apply now by clicking the \"Apply On Company Site\" button and sending us your resume.\nSalary: $90,000 - $155,000 per year\n\nA bit about us:\n-\n\nBased out of the bay area, this hypergrowth AI company is changing how e-commerce companies view data. Their platform reacts to customer demands, supply chain fluctuations, and market conditions allowing companies real-time data leading to a more predictable revenue stream. Want to use some of the latest technology in AI, NLP, and ML to drive growth and optimize performance?\n\nWhy join us?\n-\n\n401(k) matching\nDental insurance\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nProfessional development assistance\nRelocation assistance\nVision insurance\n\nJob Details\n-\n\nBachelors Degree in Computer Science or relevant field\n5+ years working with Java and/or Python Flask\nExperience with Code Deploy/Jenkins/Git\nUnderstanding of JavaScript and HTML 5\nFamiliar with event-driven programming in Python\nInterested in hearing more? Easy Apply now by clicking the \"Apply On Company Site\" button. #indtier2Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "Sunnyvale, CA",
  "jobTitle": "WorkCog4.3 ★DevOps EngineerSunnyvale, CA$58.86 - $70.89 Per Hour(Glassdoor est.)Easy ApplyAbility to work with diverse personalities both technical and non-technical. Provide DevOps implementation, design and architecture.…28d",
  "jobDetails": "Role: DevOps EngineerExperience : 9- 13+years requiredvisa : GC , USC , all EAD'sContract W2 roleLocation : CA (Onsite)Responsibilities:· Provide DevOps implementation, design and architecture.· Bring the DevOps best Practices on to the table.· Responsible for supporting implementation projects.· Create or contribute to technical project documentationSkills and Knowledge:· Strong technical knowledge (details below)· Focused and driven attitude towards contributing on the creation, enhancement and delivery of complex solutions· Ability to work with diverse personalities both technical and non-technical· Ability to work flexible schedules particularly when software installs are scheduled· Proven ability to work independently with limited supervision· Excellent organization and time management skills· Excellent written and verbal communication skills· Ability to resolve escalated issues with a sense of urgencyEducation and Experience/Requirements:· 8+ years of experience· Strong knowledge & Experience in Terraform,· Hands on experience in DevOps/AWS /EC2/RDS/Red shift· Strong knowledge & Experience in Pipeline building· Strong knowledge & Experience in Cognito,· Strong knowledge & Experience in Lambda,· Strong knowledge & Experience in Node.JSJob Type: ContractSalary: $58.86 - $70.89 per hourAbility to commute/relocate:Sunnyvale, CA 94085: Reliably commute or planning to relocate before starting work (Required)Experience:Azure: 4 years (Preferred)AWS: 5 years (Preferred)Kubernetes: 4 years (Preferred)Work Location: Hybrid remote in Sunnyvale, CA 94085Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Associated Students of3.8 ★IT Support SpecialistSan Jose, CA$18.00 Per Hour(Glassdoor est.)Easy ApplyMust be a current SJSU student enrolled in Bachelor's or Master’s program in Computer Science / Engineering, or a related field.…2d",
  "jobDetails": "Position Title: IT Support Specialist\nPosition Department: Information Technology/Print & Technology Center\nFLSA Status: Non-Exempt\nFull/Part-Time: Part-Time, Student\nCompensation: $18.00 per hour\nReports To: Senior IT Support Specialists & PTC Manager\nClick here to apply!\nAssociated Students Summary\nAssociated Students’ (A.S.) mission is to support and represent the students of San José State University by continuing the organization’s legacy of student advocacy and leadership; to enhance SJSU students’ education through high quality programs and services; and to prepare students as they move towards a thoughtful and purposeful life after graduation.\nA.S. is a non-profit auxiliary corporation serving the students of San Jose State University whose primary source of funding is from mandatory student body fees. A.S. Departments include the Cesar Chavez Community Action Center, Child Development Center, General Services Center, Human Resources, Information Technology, Events, Marketing, Print & Technology Center, Student Government, and Transportation Solutions.\nPosition Summary\nThe IT Support Specialist performs a variety of functions related to the daily IT Services, including, but not limited to, providing technical support, computer diagnostics and troubleshooting, research and development of new IT solutions, and collaborating with team members.\nEssential Functions\nTroubleshooting and resolving hardware and software related issues. Installing and removing hardware and software components.\nResearch and development of new methods, applications, and programming strategies for improving performance and reliability of our IT resources and services.\nDeploying computer updates and patches in a timely manner.\nTrain and educate other team members / staff members on an as-needed basis.\nHelp and coordinate with certain non-programming / non-IT related support or assistance on an as-needed basis.\nKnowledge, Skills, & Abilities\nRequires skills in troubleshooting software and hardware related issues.\nRequires strong time and project management skills.\nRequires excellent verbal and written communication skills.\nAbility to work effectively and efficiently in a diverse University environment.\n\nWork Environment, Hours, and Physical Demands\nMust be able to work at least 12 hours/week, with a minimum of 2 hours per shift. Operating hours are Mon-Fri, 8:00AM – 5:00PM.\nMust be able and available to work during summer, winter, & spring break.\nThis job operates in an office environment and routinely uses standard office equipment.\nMust be able to operate a computer, including a keyboard and mouse, and phone.\nMust be able to occasionally lift or carry office or technology products or supplies, up to 50 pounds.\nOther Duties\nThis job description is not designed to cover or contain a comprehensive list of activities, duties or responsibilities that are required of the employee for this job. Activities, duties, or responsibilities may change at any time, with or without notice. Employee must be available for at least 12 hours of work each week, and must be available for in-person operation.\nEducation Experience\nMust be a current SJSU student enrolled in Bachelor's or Master’s program in Computer Science / Engineering, or a related field. At least 2 years remaining for graduation at SJSU is required.\nCompTIA A+ certification is highly recommended for this position. Incumbent candidates should acquire A+ certification within six months of employment.\nRequired Skills / Credentials\nWindows 7/8/10/11, Mac OS, iOS, and Android.\nPreferred Skills\nPerl / Python / PHP / Powershell / UNIX Shell scripting / Javascript\nHTML, CSS, XML\nWindows 2008/2012, and Linux/UNIX type servers\nAble to fully disassemble, diagnose, and repair various electronics\nAble to fully assemble a desktop PC from separate components\nNotes to Applicants\nAll Associated Students employees must be fully vaccinated against COVID-19 no later than September 30, 2021, unless they are exempt from this requirement because an exemption has been granted based on a medical contraindication or sincerely held religious beliefs. Fully vaccinated means that an individual has received all recommended doses of a COVID-19 vaccine that has received Emergency Use Authorization or full approval from the U.S. Food and Drug Administration (FDA) and that it has been at least two weeks since the final recommended dose.\nThe person holding this position is considered a mandated reporter under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 Revised July 21, 2017 as a condition of employment.\nThis position may be exposed to sensitive or personal information and is required to comply with the requirements set forth by the Integrated CSU Administrative Manual 8000 series and Associated Students Information Security Standards as a condition of employment.\nA background check (including a criminal records check) must be completed satisfactorily after a conditional offer of employment. Failure to satisfactorily complete the background check may affect a conditional offer of employment.\nEqual Employment Statement\nAssociated Students provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. A.S. provides reasonable accommodations for applicants with disabilities who self-disclose.\nApplications\nApplicants must submit a complete application through the Associated Students applicant tracking system, ADP. Only complete applications will be considered.\nDeadline\nThe position will remain open until filled.\nClick here to apply!Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "Fremont, CA",
  "jobTitle": "InterSources IncSoftware EngineerFremont, CA$94K - $136K (Glassdoor est.)Easy ApplyWork within the engineering team and other teams to design, develop, test, implement, and. Familiarity with relational database technologies and tools.…30d+",
  "jobDetails": "Job Title: Software Engineer\nLocation: Remote US\nLocation Status: 100% remote\n\non PHP development in a LAMP environment\nWork within the engineering team and other teams to design, develop, test, implement, and\nsupport technical solutions within Customer. Work with product owners and other stakeholders to understand desired application capabilities and testing scenarios.\nEnhance support and maintain existing applications and new application development.\nThe ability to train lower technical staff\nWork both independently and as part of a team\nAssist in collecting application requirements, application design, testing, and documentation\nMeaningful input on new application design\nDevelop solutions for data transfer, interchange, and integration problems with other systems.\nJob Requirements:2-3 years of hands-on development experience using PHP, JavaScript, and MySQL\nFamiliarity with relational database technologies and tools. Especially MySQL/MariaDB.\nHTML/HTML5/CSS/Bootstrap Web UI design skills required.\nExperience with JavaScript frameworks like AngularJS, Vue.js is a plus\nExperience in PHP frameworks like Laravel/Lumen framework is a plus\nAt least 1 year of experience with designing and developing APIs\nAt least 1 year of experience with Amazon Web Services (AWS)\nAt least 1 year of experience with software architecture and design Experience with Git and GitHub\nGeneral understanding of security practices and threats as it pertains to web development\nFamiliar with design patterns and development practices\nNice to about engineering\nAbility to be a self-starter in a dynamic and fast paced environment\nEager to learn new technologies\nWork successfully in a distributed team environment including contractors and employees\nExcellent communication skillsShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Palo Alto, CA",
  "jobTitle": "Wurl, LLC4.7 ★Full Stack EngineerPalo Alto, CA$97K - $148K (Glassdoor est.)Easy ApplyExperience using client-side state management tools like Redux and Apollo Client. 3 years of complete software lifecycle experience, including design,……30d+",
  "jobDetails": "About Wurl, LLC.\n\nWurl is a global streaming network. Our B2B services provide streamers, content companies, and advertisers with a powerful, integrated network to distribute and monetize streaming television reaching hundreds of million of connected televisions in over 50 countries. This year Wurl was acquired by AppLovin (Nasdaq: APP), an industry-leading mobile marketing ad tech company, bringing together the technology and innovation of the mobile and television industries. With the merger, Wurl employees enjoy the best of both worlds: the dynamic environment of a 160+ person start-up and the stability of a high-growth public tech company.\n\nWurl is a fully-remote company that has been recognized for a second year in a row as a Great Place to Work. Wurl invests in providing a culture that fosters passion, drives excellence, and encourages collaboration to drive innovation. We hire the world's best to build a bunch of cool stuff on an interface fully integrated with their own from streaming, advertising and software technology to continue to help us disrupt the way the world watches television.\n\n\nFull Stack Engineer - (Remote, US)\n\nIn this role, you will be a key member of the Wurl engineering team that's building and maintaining the systems responsible for transcoding and storage of video content for all of Wurl's streaming and VOD channel deliveries. Challenges of this position include creating video renditions at scale, managing auxiliary files (images, closed captions etc.), defining and implementing media retention policies, and maintaining a high standard of quality control for all incoming and generated media.\n\nWhat You'll Do\n\nShape and revolutionize the future of streaming TV\nBuild innovative, market-leading technologies to help content companies and streamers succeed\nParticipate in a 100% open environment where everyone is encouraged to share ideas, big and small\nLearn and grow in a rapidly accelerating industry\nQualifications\n3 years of complete software lifecycle experience, including design, architecture, and implementation of software features\n1 year of experience writing and testing dynamic, modern Javascript and Ruby on Rails applications\n1 year of production experience with JavaScript frameworks such as React\nExperience with JSON API-level interface, and GraphQL\nExperience with RBDMS and SQL, Postgres\nExperience using modern web technologies and network transports (WebSockets, Redis)\nExperience working with AWS services - EC2, Lambda, RDS, S3, SQS/SNS\nExperience with syndication of data to and from third parties via XML/JSON\nStrong verbal and written communication skills, including documenting software design and process\nWorking knowledge of software engineering design principles and processes, including Test Driven Development\nWorking knowledge of engineering fundamentals and best-practices such as git-flow, pull requests, code reviews, SLAs\nExperience with Agile Scrum\n\nA Plus if You Have\n\nExperience using client-side state management tools like Redux and Apollo Client\nAn understanding of the W3C Media Source Extensions and the video tag\nKnowledge of video delivery standards (HLS, MP4, RTMP, DASH, MRSS, MP-TS, RTMP)\n\nWe recognize that not all applicants will not always met 100% of the qualifications. Wurl is fiercely passionate and contagiously enthusiastic about what we are building and seeking individuals who are equally passion-driven with diverse backgrounds and educations. While we are seeking those who know our industry, there is no perfect candidate and we want to encourage you to apply even if you do not meet all requirements.\n\n\nWhat We Offer\n\nCompetitive Salary\nStrong Medical, Dental and Vision Benefits, 90% paid by Wurl\nRemote First Policy\nDiscretionary Time Off, with minimum at 4 weeks of time off\n12 US Holidays\n401(k) Matching\nPre-Tax Savings Plans, HSA & FSA\nCarrot and Headspace Subscriptions for Family Planning & Mental Wellness\nOneMedical Subscription for 24/7 Convenient Medical Care\nPaid Maternity and Parental Leave for All Family Additions\nDiscounted PetPlan\nEasy at Home Access to Covid Testing with EmpowerDX\n$1,000 Work From Home Stipend to Set Up Your Home Office\n\nFew companies allow you to thrive like you will at Wurl. You will have the opportunity to collaborate with the industry's brightest minds and most innovative thinkers. You will enjoy ongoing mentorship, team collaboration and you will have a place to grow your career. You will be proud to say you're a part of the company revolutionizing TV.\n\nWurl provides a competitive total compensation package with a pay for performance rewards approach. The expected base pay range for this [CA based or North America based] position is $155,000 - $175,000. Base compensation at Wurl is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Depending on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical and other benefits.Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "Cupertino, CA",
  "jobTitle": "theCoderSchool CupertinoCode CoachCupertino, CA$18.00 - $36.00 Per Hour(Glassdoor est.)Easy ApplyDeep technical skills aren't required - we prefer you communicate well and find answers along with students than know everything upfront.…30d+",
  "jobDetails": "Code Coach Job Description v1.2 Feb 2021______________________________________________________________________________________________Who We AretheCoderSchool is an after-school drop-off program for kids learning to code with several Bay Area locations and growing.The future will be ever more dependent on technology so let's get our young generation ready. Learn to Code, Change theWorld. cupertino.thecoderschool.comJob SummarytheCoderSchool Cupertino is looking for passionate Code Coaches to teach in-person our next generation how to change the world! You will meet incredible kids, teach them how to code (and how to think like a coder!), and be rewarded with an amazing experience. We offer a flexible schedule as this is a part-time position for 3-25 hours/week (same times weekly). You get work as many hours are you prefer and set your own schedule within our open hours which are M-Th 4-8pm and Sat. 9-4pm. The teaching is done in person primarily but we do have some virtual teaching options too.We will provide Instructor Training, and will use more of a “teaching methodology” than a curriculum. Much of our teaching will be reverse-engineering games or concepts, and will adapt to a particular student's interests and skills.ResponsibilitiesA Code Coach is a mentor who teaches kids how to code. At theCoderSchool, we have three basic teaching styles - your assignment will depend on schedule, ability, and desire.1. Private and Semi-Private Tutoring. One-to-one or one-to-few coding lessons for kids. Typically in Scratch/Snap for the younger folks, with Python or Javascript/HTML or Java, C++ and beyond for the advanced kids.2. Code Class. Traditional curriculum based classes with a larger student to teacher ratio.This position rocks because you will:Meet, mentor, and grow amazing kids who are excited to learn, and potentially manage a team of kids to create an application.Meet and communicate with parents - many of whom will be techies themselves, who work at some of the best companies and startups in the Bay Area.Give back to the community and help grow our next generation by sharing your knowledge of technologyRequirementsWhat do we want from you? Read on.PASSION . All caps! This is all about giving back to the kids. We need to see goose bumps when your studentROCKS a code challenge.Great Communicator. There will be plenty of chatting with parents, and of course patience is a virtue when it comes to kids!Street Cred. Our college-level Code Coaches will have Comp Sci or Engineering or similar major at a nearby accredited school. Our Veteran Code Coaches will have relevant industry experience.Coding Skills. Strong grasp of basic procedural programming. Experience with Python and willingness to learn scratch (scratch.mit.edu).Deep technical skills aren't required - we prefer you communicate well and find answers along with students than know everything upfront.Teaching Experience. Experience teaching kids in any subject is a plus, as is experience with Scratch or Snap.Sound awesome? Apply now with a cover letter and resume!______________________________________________________________________________________________________________________ www.thecoderschool.com10057 Saich Way, Cupertino, CA 95014''COVID-19 Precaution(s):Remote interview processPersonal protective equipment provided or requiredTemperature screeningsSocial distancing guidelines in placeVirtual meetingsSanitizing, disinfecting, or cleaning procedures in placeWork RemotelyNoJob Type: Part-timePay: $18.00 - $36.00 per hourBenefits:401(k)Supplemental pay types:Bonus payCOVID-19 considerations:All staff are fully vaccinated.Education:High school or equivalent (Preferred)Work Location: In personShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Palo Alto, CA",
  "jobTitle": "Point Digital Finance, Inc.4.4 ★Staff Software EngineerPalo Alto, CA$141K - $265K (Glassdoor est.)Easy ApplyPoint will true-up wages from state-applicable PFL earnings so that the employee's total gross pay will be equivalent to 100% of their regular base pay, as well……1d",
  "jobDetails": "Local or 100% Remote\n\nWho we are\n\nOur mission at Point is to make homeownership more valuable and accessible to all. Every day, we explore, build, and iterate to create innovative financial products that improve the lives of our customers. Together, we're creating the premier full-stack home equity platform to help current homeowners access their home wealth and aspiring ones realize their dream of homeownership. We recently raised a $120M Series C led by WestCap, and have raised over $170M overall from Andreessen Horowitz and other leading investors.\n\nAbout the role\n\nYou will be an integral part of a tight-knit engineering team working to design and implement new features, improve our architecture and take the lead to launch new products. The people who thrive at Point are product-focused engineers who care deeply about our customers and get excited about using technology to help make an impact in people's lives. We're looking for people who are comfortable working throughout the product development cycle and across all levels of the tech stack to deliver business results quickly.\n\nOur tech stack is anchored by Ruby on Rails, React, and PostgreSQL.\n\nYour responsibilities\n\nTechnical and design leadership across high impact projects that directly impact business goals\nSet Strategic technical directions for the engineering organization\nCollaborate and partner with the design team and product managers to create an engaging and transparent customer experience\nInitiates, directs and facilitates alignment and clarity across teams on goals, outcomes, and timelines criticality related to corporate strategy, products, potential inventions and ability to resolve existing problems.\nBe a highly hands on engineer that manages project priorities, deadlines, and deliverables\nDesign, develop, test, deploy, maintain, and enhance large scale software solutions\nInfluence and mentor a distributed set of engineers\n\nAbout you\n\nWe're looking for at least 12+ years of professional experience with 4+ years in a technical leadership role leading project teams and setting technical direction\nExpert experience building scaled web-based applications with deep understanding of business goals\nPrior experience working for a startup is preferred.\nA formal degree in computer science is helpful, but we have people working in this role with only a high school diploma and others with PhDs. We care more about what you can deliver.\nExceptional technical design and technical communication skills.\nAble to mentor experienced engineers to help them grow in their technical proficiency and leadership skills\nAble to negotiate trade offs between product and engineering priorities to maximize the business value of engineering effort\nStrong proficiency with one or more programming languages (Ruby, Python, JavaScript, Java, etc)Experience with UI development, product security and/or DevOps is helpful\n\nOur benefits\n\nGenerous health benefits\n\nWe provide medical, dental, and vision plans with options for flexible spending accounts (FSA) and health savings accounts (HSA). Point covers 99% of employee medical, dental, and vision premiums.\n\nUnlimited paid time off\n\nRecharge with unlimited paid time off and 10 company holidays.\n\nFlexible remote & onsite work\n\nOur teams work from many different locations and time zones. We support fully remote work and also have an amazing in-person environment in our downtown Palo Alto, CA HQ.\n\nFully paid parental leave\n\nPoint will true-up wages from state-applicable PFL earnings so that the employee's total gross pay will be equivalent to 100% of their regular base pay, as well as two weeks of fully paid leave to be available after exhaustion of state PFL.\n\nFor employees in states without Paid Family Leave, Point will provide up to 8 weeks of paid parental leave.\n\nIn addition, all employees will receive 4 weeks of fully paid transition time. For four weeks after returning from parental leave, and following the use of all other paid leave benefits, you may work part-time, meaning two or three days per week, and receive 100% of regular base pay.\n\nFinancial wellness\n\nWe provide 401K retirement plans for employees as well as guaranteed life insurance and short- and long-term disability coverage. Full-time employees have the opportunity to take ownership in the company through equity options.\n\nExtra work/life benefits\n\nWe provide monthly stipends for internet, mobile plans, and a one-time home office reimbursement.\n\nPoint is proud to be an equal opportunity employer. We provide employment opportunities regardless of age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, veteran status, or any other protected class. Each individual at Point brings their own perspectives, work experiences, lifestyles, and cultures with them, and we believe that a more diverse team creates more innovative products, provides better services to customers, and helps us all grow and learn.\n\nThe expected base salary range for Technical roles (e.g. Engineering, Product, Design) at this level within Point is $140,800 - $265,000 per year. This does not include any other potential components of the compensation package, including equity, benefits, and perks outlined above. At the launch of each position we benchmark compensation to the appropriate role and level utilizing competitive compensation data from various data sources as references. At the offer stage we use the signal we received from our interviews coupled with your experience, location, and other job-related factors to determine final compensation.\nCalifornia Consumer Privacy Act NoticeShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Softnet Consulting Inc5.0 ★Web Developer- JavaScript, EDI, PHPSan Jose, CAEasy ApplyFamiliarity with network diagnostics tools. Experience with mockup and UI prototyping tools. Identify user and system requirements for new websites and……30d+",
  "jobDetails": "Requirements\nWork experience as Web Developer (WWW)\nExpertise in Javascript, PHP and EDI\nSolid knowledge of HTML/CSS\nExperience with mockup and UI prototyping tools\nUnderstanding of security practices\nFamiliarity with network diagnostics tools\nTeam management skills\nResponsibilities\nIdentify user and system requirements for new websites and applications\nCreate wireframes to decide on layout\nWrite or review code for various applications\nRun functionality testings and debug codeShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "eTrigue3.2 ★(1) UI DeveloperSan Jose, CA$105K - $144K (Glassdoor est.)Easy ApplyDesign and develop elegant UI and intuitive front end applications running on any desktop, laptop, tablet and mobile devices (iPhone, Android).…30d+",
  "jobDetails": "Position Overview\nAre you someone who is comfortable working across the full technology stack? Are you energized by taking on challenging problems? Do you continually seek to develop your skills, learning tools and technologies that help you master your profession? If so, we are looking for you! As a UI Developer at eTrigue, you will work within a small team of likeminded and talented engineers in a focused, no bureaucracy environment, striving to push the limits of our capabilities while delivering tremendous value to our customers.\nWhat You Will Do\nDesign and develop elegant UI and intuitive front end applications running on any desktop, laptop, tablet and mobile devices (iPhone, Android).\nDesign for extensible and scalable multi-threaded solutions, optimizing for resource utilization, performance, and supportability.\nHelp drive the definition of PHP and JavaScript frameworks to support new features and refactor legacy elements.\nWhat We Are Looking For\n6+ years of UI/UX development experience.\nStrong knowledge of HTML, CSS, JavaScript, JSON.\nStrong UX and design sensibilities.\nExperience developing and maintaining complex web architectures leveraging object oriented PHP and JavaScript required.\nProficient understanding of code versioning tools (e.g. Bitbucket).\nStrong verbal and written communication skills.\nExperience integrating with REST APIS.\nProficient in a broad range of software design approaches and common UX patterns.\nExperience configuring and tweaking Apache, Node.JS, and Nginx servers a plus.\nExperience with PHP web frameworks such as Laravel, CodeIgniter a plus.\nStrong database knowledge (MySQL, MariaDB) a plus.\nExperience with AWS Framework a plus.\nThis is a full-time position with salary, benefits, healthcare, PTO, and matching 401k. No recruiters please. Proof of eligibility to work in the United States is required. Greencard and citizens only, no H1 sponsorship.\nAbout eTrigue\nLeading Marketing Automation SaaS provider (world-wide client base).\nProven product, in hot market for marketing/big data/analytics\nISO Stock options with no dilution\nNo red tape to get your work done\nMore at etrigue.com\nW49JcNIgFuShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Fremont, CA",
  "jobTitle": "Exxact Corporation3.7 ★Software DeveloperFremont, CA$88K - $152K (Glassdoor est.)Easy ApplyExxact Corporation is looking for a senior level Software Developer to maintain, design, develop, customize, test, deploy, and support all internal applications……30d+",
  "jobDetails": "Exxact Corporation is looking for a senior level Software Developer to maintain, design, develop, customize, test, deploy, and support all internal applications from 3rd party to custom in-house applications, including ERP, CRM, quoting, production, RMA, EDI, and eCommerce applications.Job Responsibilities:Play a key role in team leadership to ensure projects remain on schedule and all target requirements are metResponsible for building large scalable software infrastructureHandle all internal and 3rd party applications, writing custom code, and building on top of 3rd party applicationsManage connections between applications through iPaaS middleware such as Celigo, Dell Boomi, and Muv or via custom solutionsJob Requirements:4+ years of experience in building database-driven applications and websitesExperience with Agile framework, Jira project tracking, Git, and software development processesBroad software/application development skillsExpert with JavaScriptWorking knowledge of Node.jsAdditional skills/knowledge: CSS, HTML, Bootstrap, XML, RESTful APINice To Have Skills:Netsuite ERP experience (SuiteScript) is a plusGCP knowledge / experience is a plusAngularMongoDBPHP – used in custom applicationsJob Type: Full-timePay: $88,008.00 - $152,413.00 per yearShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "Sun-Net Inc.4.1 ★Full Stack EngineerSan Jose, CA$79K - $126K (Glassdoor est.)Easy ApplyMotivation to document work and also write technical/functional specifications. Strong coding, debugging, algorithm design and problem-solving skills.…30d+",
  "jobDetails": "Sun-Net is looking for smart, agile, intellectually curious engineers who will help us in our mission to build secure, scalable, reliable and efficient software for our customers in Electric Utility industry. Sun-Net's iTOA software is being used by thousands of people who deliver power on a daily basis. We are a close-knit team with a passion for improving overall user experience and well regarded among our customers for our reliable product and excellent customer service. Sun-Net offices are conveniently located in San Jose, California by SJC, with easy VTA transportation and close proximity to major highways.\nYou can look us up at: www.sunnetsoftware.com\nThis is a unique opportunity where you can explore and implement your skills in both frontend and backend aspects of software development. The ideal candidate will be a self-starter who can collaborate with peers to solve day-to-day problems, has a passion of designing efficient algorithms and has great debugging skills.\nResponsibilities:\nYou will be working with a team of talented engineers, Project Management, and get a chance to work closely with our customers to solve problems and build software impacts daily operations of energy utilties.\nAs a Software Engineer, you will take part in Requirement gathering, Efforts estimation, Design and Development for our enterprise product iTOA® (integrated Tools for Operations Application).\nTechnical Qualifications:\n3+ years of industry software engineering, software development experience\nBS or MS in Computer Science or related disciplines or equivalent\nExperience in developing, debugging and maintaining code in object-oriented languages and database querying languages.\nStrong coding, debugging, algorithm design and problem-solving skills.\nWe are currently hiring candidates with a strong knowledge of:\nFront-end Technologies:\nAdvanced knowledge of JavaScript, CSS, HTML and responsive web design.Experience with Vue, React, Angular or similar frameworksKnowledge of REST concepts. GraphQL is a plus.Bonus: Knowledge of TypeScript, Webpack, LESS, SASS and Testing libraries like Chai/Mocha.\nBack-end Technologies:\nJava, J2EEHibernate, JPA, Spring, Spring BootRESTful API, SOAP API, GraphQLSQL, Oracle, MS SQL ServerBonus: Knowledge of Maven, Unit Testing frameworks.\nWe are looking for candidates with at least 3 years of solid real-world work experience with the above technologies. You should be able to demonstrate your expertise and back your experience.\nAdditionally, on the non-technical side, here are our expectations:\nWork closely with product manager, project manager, development lead and users to gather requirements and translate them into scenarios and actual code.Ability to estimate effort required to complete assigned projects/enhancementsCollaborate with QA team to ensure quality of software deliverables.Effective and positive communication skillsMotivation to document work and also write technical/functional specifications.Day to day work will also involve ad-hoc end-user customer support.\nApplicant must be a US Citizen or holds a green card.Show more  Report"
},
{
  "employerName": "",
  "jobLocation": "San Jose, CA",
  "jobTitle": "SSI4.1 ★Front-End Developer (Mandarin MUST - Will Train - Nationwide)San Jose, CA$60K - $90K (Glassdoor est.)Easy ApplyIn fields of healthcare, banking, and financial services, high-tech IT business, retail and e-commerce, insurance, entertainment, telecom and cable, pharmacy……23d",
  "jobDetails": "About SSI:A global leader in consulting, technology services, and scalable software innovation, SSI is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital, and platforms. SSI, a concern of Silicon, Inc, is one of the leading providers of Enterprise software solutions, comprehensive IT solutions, including Systems Integration, Consulting, Information Systems outsourcing, IT-enabled services, telecommunication, R&D etc. SSI specializes in placement of UI Developers, ReactJS, AngularJS, Quality Assurance Analyst, Data Analyst, Software Developers, UX Engineers etc. in fields of healthcare, banking, and financial services, high-tech IT business, retail and e-commerce, insurance, entertainment, telecom and cable, pharmacy and life science, oil and gas, travel and transportation, and local and state government for both permanent and contract C2C staffing arrangements. Our recent placements include Apple, Google, Facebook, JPMC, Wells Fargo and several other fortune 500 companies.Website: https://silicon.inc/H1B Info: https://h1bdata.com/pin/silicon-inc/Knowledge and Skills:Exposed to and/or experienced with several technologies such as: React JS, SASS, JSON, AJAX and BootstrapProvided solid markup skills in utilizing HTML5, CSS3, JavaScript, and jQueryDeveloped front-end skills and some basic understanding of how back-end development worksKnowledge of designing mark up, developing the UI of websites and/or web applicationsDemonstrated understanding of UX and UI design with an emphasis on maximizing usabilityKnowledge of using REST web services and working with interface designDesired to work in a collaborative, innovative, flexible and agile JavaScript Development team-oriented environmentFluent in Mandarin (Mainland).Education and Qualities:Bachelors/ Master’s degree in Computer Science or related fieldStrong written and oral communication skills in both English and Mandarin preferredDetail oriented, ability to multitask with strong prioritization, planning and organization skillsWilling to relocate and familiar with CCC business frameworkBenefits:Lucrative Annual Base SalaryFull Health Insurance CoverageImmediate H1B, STEM Ext. or GC SponsorshipAccess to exclusive training & mentorship by Senior Google, Microsoft, and Apple engineersHelpful Info:Training Location: Milpitas, CA (at the heart of Silicon Valley)Starting Salary: $60,000.00Placement: Anywhere in US (Must be willing to relocate)Visa sponsorship is available for qualified employeesNo experience required but better to haveMUST be Onsite for marketing after training - NO EXCEPTIONJob Type: Full-timePay: $60,000.00 - $90,000.00 per yearBenefits:Dental insuranceHealth insuranceVision insuranceCompensation package:Yearly payExperience level:1 yearNo experience neededUnder 1 yearSchedule:8 hour shiftMonday to FridayWeekend availabilityExperience:HTML5: 1 year (Preferred)Language:Mandarin (Required)Work Location: In personShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Santa Clara, CA",
  "jobTitle": "8aNetWeb DeveloperSanta Clara, CAEasy ApplyCreative; able to develop simple approaches to complex design problems. Knowledge in JavaScript, VBScript and at least two of the server side scripting……1d",
  "jobDetails": "Please email your resume to: hr@8anet.com\nJob Description:\nUnderstand product development lifecycle. Able to learn existing systems quickly and build upon them. Creative; able to develop simple approaches to complex design problems. Able to handle multi-tasks with flexible and positive attitude. Work well with other team members to motivate and solve problems\nQualifications:\nBachelor or Master Degree in Computer Science\nExperiences with web development desirable\nKnowledge in Microsoft SQL\nKnowledge in Microsoft .NET platform\nKnowledge in JavaScript, VBScript and at least two of the server side scripting languages: ASP, .NET desirableShow more  Report"
},
{
  "employerName": "",
  "jobLocation": "Sunnyvale, CA",
  "jobTitle": "WalmartMERN Stack Developer at Walmart (React/Node)Sunnyvale, CA$120K - $180K (Glassdoor est.)Easy Apply_Should have strong experience with REST-based API design and development_. _Must have proficiency with programming languages Node.js.…22d",
  "jobDetails": "Title: MERN Stack Engineer (React/Node)Skills: Javascript, Typescript, ReactJS, Redux, NextJS, NodeJS, NestJS, Microservices, AWS, GraphQL, MaterialUI, Socket.io, Kubernetes, ServerlessOverview:We have 6 positions for a MERN Stack Developer at Walmart. They need candidates who are strong with ReactJS and NodeJS and must be able to go HYBRID in their Sunnyvale, CA office.HYBRID - 2 DAYS PER WEEK IN SUNNYVALE, CAClient: WalmartLocation: SUNNYVALE, CADuration: 18+ monthsRole: MERN Stack DeveloperLong Term ContractWe are looking for MERN Stack developers with hands-on experience in AWS Serverless technologies.The candidate will have excellent communication, collaboration, and documentation skills.Qualifications:Must be strong and recent experience in ReactJS and Node.JSReact development using Typescript, Redux, Hooks and ContextAPI.Must be strong experience API development10+ years of experience as a code-contributing member of an Agile Development TeamShould have strong experience with REST-based API design and developmentAdvanced in Node.js API, Graph QL and Microservices developmentMust have proficiency with programming languages Node.js. React.js and Typescript.Experience with Git, writing unit tests, continuous deployment, and code documentation.Intermediate in AWS Infrastructure as Code (IaC) technologies - CloudFormation or AWS CDK or Terraform.ABOUT US:Anagh Technologies is a technical consulting firm specializing and working ONLY in UI, Front-End and Full-Stack web technologies.We currently have 40+ positions in Angular, React, Node and Vue. If technically strong, we can 100% get you an offer within 2 weeks MAX as we will consider you for multiple roles at once.If interested and are available, please email me your resume and contact information to adam.h AT anaghtech DOT com or call me at 908-777-0015. Thank you for your time.Job Types: Full-time, ContractPay: $120,000.00 - $180,000.00 per yearBenefits:Dental insuranceHealth insuranceVision insuranceSchedule:8 hour shiftEducation:High school or equivalent (Preferred)Work Location: In personSpeak with the employer+91 9084456269Show more  Report"
}]